{"songs": [{"title": "A Message from Yasiin Bey [via Kanye West]", "album": null, "year": null, "lyrics": "Ain't home arrest, I don't need to stay<endline>I'll leave and I'll stay away<endline>I committed no crime any place<endline>Why these police up in my face?<endline>Why they raiding my place?<endline>Why I don't feel safe?<endline>This is not an expression of fear<endline>This is just to make things clear<endline>My intentions are pure in coming here<endline>And that's for everything I love or hold dear<endline>Umi's in the building<endline>So is my wife and my children<endline>I committed no crime<endline>Why is the state wasting my time?<endline>They must be out of their minds<endline>I forgive 'em, that's the spirit of divine<endline>I just wanna go where I'm wanted<endline>Where I'm loved, stop frontin'<endline>Where I live is my choice, you cannot mute my voice<endline>Thank you, Kanye West, for being a real friend, a real friend<endline>A real friend<endline><endline>I heard your choice the first time, I'll go away<endline>And when I leave, that's exactly where I'll stay<endline>This is not an expression of fear<endline>This is just to make things clear<endline>A country called Earth, everywhere<endline>A country called Earth, everywhere<endline><endline>The state of South Africa has interfered with my ability to move or to even fulfill my professional obligations unnecessarily. And that's fine; we don't have to be enemies and we don't have to be friends either. My family and I are prepared, immediately, to make whatever move that we need to make outside of this state, never to return to this state again. We don't have to be here. We're not pining to be here, and we’re complying in every possible way, reasonably. Just today, state officials visited my domicile asking questions about me and my family, and they had no right to do so. I have legal representation here who they could easily contact. They're contravening and breaking all types of international law, and it's untenable for me to just sit by and just let this go on. And I know it's been a lot of chatter about what's going on, you know, people are running to the press, because that's just…you know, a money making machine. So, it’s another exploitative measure to turn this into some soap opera, some tele-novella, and I have no interest in it. Furthermore, related but not directly related to this: I'm retiring from the music recording industry as it is currently assembled today, and also from Hollywood, effective immediately. I am releasing my final album this year. Um…and that's that<endline><endline>Peace to all, fear of none. Thank everyone for their time. Much success to you, even if you wish me the opposite, as Nas said. And I'm on the side of the right, so people could wish however they want, but I ain't nobody's…I ain't no threat or a hazard to nobody. I really try to mind my business. What people think about me is none of my business, and I'm not here to change people's opinions about me. You don't have to like me; you don't have to like everything that I say. The fact is, is that I have hurt no one. I have injured no parties, and all I require, as is my lawful right, is innocent passage to my domicile. That is all<endline><endline>In summary, I will say this, I will close with a simple prayer: To the one who has created the all, you know me better than I know myself, and I know myself better than people know me. So, forgive me for whatever they know or do not know. Make me better than whatever is said and do not make me responsible for whatever is said. Ameen, ameen, allahumma ameen<endline><endline>And I'll close for you, Ye, with the, with the verse that I kicked for you on December 31st, when you was in Atlantic City and you announced that you and Kim were having Nori. And, and, shout out to Madlib, and Otis, and…and…and Michael and his entire family, and to Mama Jackson and to the whole Jackson clan in L.A., I wish you and your family the best, your mother, you know, reach out to me, Egon, you know, y'all know how to reach. Shout out to Corey Smyth, shout out to my brother Talib Kweli, salaam to my brother Kamaal Fareed, Ali Shaheed Muhammad, Islam, all of the Zulu Nation. The Zulu Nation real here; there's real Zulus. My brother, Siyabonga, the Madlalas. All of the people here who have supported me: this is no reflection on you. I love the people of this country. I love this continent. I do not have to sit idly by and just be persecuted unfairly by a state. They waste enough of my time and... I'm through with you Felicia... we're through. I don't want nothing from you. You can keep the records, the sweatshirts, everything; it's no problem. But I'll end with this verse that I wanna put on \"No More Parties in LA,\" if you would kindly allow me, my dear brother Kanye. And shout out to K. Lamar, too; I see you, my dude<endline>Lonely America, crazy America<endline>Loud ass, country ass, cocaine America<endline>Lethal America, carcinogen, asthma<endline>Carbonated smoke throughout your blood plasma<endline>Lights and camera, action, surveillance<endline>Helicopters, teleprompters<endline>Flossy newscasters, rich, fool, bastards<endline>War, migrant workers, cold murder, traffic<endline>Welcome to Los... stop right there<endline>Biggie got shot right here<endline>Angeles<endline>Hollywood, hoes, handguns<endline><endline>Peace to all, fear none. This is Bey. Love. One", "image": "https://images.rapgenius.com/5567fdef5aacda9a144010c8a3c2187d.603x603x1.jpg"}, {"title": "Auditorium", "album": null, "year": null, "lyrics": "The way I feel, sometimes it's too hard to sit still<endline>Things are so passionate, times are so real<endline>Sometimes I try and chill, mellow down, blowin' smoke<endline>Smile on my face but it's really no joke<endline>You feel it in the street, the people breathe without hope<endline>They goin' through the motion, they dimmin' down the focus<endline>The focus get cleared then the light turn sharp<endline>And the eyes go teary, the mind grow weary<endline>I speak it so clearly sometimes y'all don't hear me<endline>I push it past the bass, know nations gotta feel me<endline>I feel it in my bones, black I'm so wide awake<endline>That I hardly ever sleep, my flow forever deep<endline>And it's volumes or scriptures when I breathe on a beat<endline>My presence speak volumes before I say a word<endline>I'm everywhere: penthouse, pavement and curb<endline>Cradle to the grave, tall cathedral or a cell<endline>Universal ghetto life, holla black you know it well<endline>Quiet storm, vital form, pen pushed it right across<endline>Mind is a vital force, high level right across<endline>Soul is the lion's roar, voice is the siren<endline>I swing round, ring out, and bring down the tyrant<endline>Shocked a small act could knock a giant lopsided<endline>The world is so dangerous, there's no need for fightin'<endline>Suckas trying to hide like the struggle won't find 'em<endline>Then the sun bust through the clouds to clearly remind him<endline>Everywhere penthouse pavement and curb<endline>Cradle to the grave, tall cathedral or a cell<endline>Universal ghetto life, holla black you know it well<endline><endline>", "image": "https://images.genius.com/b13acc0fe75405f9fde88d9e60c03a7a.640x640x1.jpg"}, {"title": "Beautiful (Black Star Remix)", "album": null, "year": null, "lyrics": "Hook [Mary singing with words by Black Star]<endline>Yes you are (Sometimes you just meet someone and you just completely...)<endline>You're so beautiful<endline>Here we go... come on<endline>Absolutely fantastic, Now you're near<endline>Absolutely fantastic, In my life<endline>Fantastic, All my fears<endline>Fantastic, Beautiful<endline>Fantastic, Come to me<endline>Fantastic, Now I am<endline>Fantastic, Someone watching over me Fantastic<endline><endline>[Mos Def]<endline>I dreamt that I could paint you with words<endline>But there were no colors bright enough<endline>Black or white enough<endline>Blue or green enough, it didn't mean enough<endline>You are the star that touched the earth<endline>Shine bright for all eyes to see<endline>Radiate and touched me<endline>Now I'm shining like you do<endline>It was dim before I knew you<endline>Bright light for weeping eyes to get used to<endline>Trust who? That's some shit to adjust to<endline>Soon as you relax, they ease back and cold bust you<endline>Love murdered in Brooklyn, sound the alarm<endline>But you said remain calm, my passion is unarmed<endline>I tried to practice my war like tactics<endline>But in the clutch of your touch, my armor just collapses<endline>Sun's bliss breeds obliviousness<endline>So recollect sweet breath still wet on my lips<endline>My prayer's this: Go protect my beloved and keep her covered From the valley to the summer like the land undiscovered<endline>(like the stars)<endline><endline>Hook<endline>[Mary]<endline>Beautiful, now you're near in my life all my fear<endline>Beautiful, come to me, now I am, someone watching over me<endline>[Black Star]<endline>Like the stars outnumbered, you are so beautiful<endline>I do all my best so I could be true to you<endline>Ain't nothing in this word that I wouldn't do for you<endline>?? everything usual<endline>Like the stars outnumbered, you are so beautiful<endline>Where I stand, understand who I am, that makes me a man<endline><endline>[Talib Kweli]<endline>You know what, they say that beauty's in the eye of the beholder<endline>So I use my third, and now I love solid like a boulder<endline>Want to be with you as I get older<endline>And that's my word, sure as I stand on my ancestors' shoulders<endline>You see through my drama and my world like a stage<endline>Not the same years but living in the same age<endline>Just the quality, not the quantity<endline>Follow me, definitely<endline>Far from probably, got to be<endline>You and me, beautifully, thick like pieces of the man I used to be<endline>Now I'm back cause of what you do to me<endline>You like my reflection, better half to my whole<endline>Like lyrics to the beat, you're the mate for my soul<endline>The breath for my life, my sister and my lover<endline>Used to have cold feet, now you the one under my covers<endline>I can't ignore your aura but it grabbed me by the hand<endline>Like the moon pulled the tide and the tide pulled the sand<endline><endline>[Mos Def and Kweli be switching back and forth like a crossfader]<endline>Because you're fruitful, beautiful<endline>Smart, lovable, huggable, doable like art<endline>Suitable to be part of the cosmos<endline>With my eyes closed, I see you clearly<endline>Combined lifetimes with like minds, your lovelight shines<endline>Bright the apple of my eyesight<endline>The tender kiss that whets my appetite<endline>My mighty Aphrodite, the flame that ignite me<endline>Your name just excite me<endline>Your eyes so alive they aright me<endline>Cause you are so beautiful<endline>You don't even know the length I would go<endline>To make absolutely sho' you is respected and protected<endline>And never neglected, I hope my prayers is accepted<endline>That you always will be watched over<endline>And never rocked over<endline>And if you need me to, I'll stop over<endline>To check on you, I'd never jet on you<endline>I know a lot of foolish cats that slept on you<endline>But what I'm gonna do is be totally committed<endline>If you need me I'll be hotter than the New York Mennen<endline>With a hundred percentage, from the start to the finish<endline>Cause the vibe you give leave me so replenished<endline>It's a new beginning, this is serious business<endline>Got my heart and soul in it<endline>It's the way that I'm living<endline>Let it be known that I'm devoted, it's always going to prevail<endline>The newly risen, truely living universal for real<endline>It's like that y'all, and ya don't stop<endline><endline>[Mary]<endline>You're the only love I know, Beautiful<endline>You're the only love that knows, Beautiful<endline>You're the reason why I live, Beautiful<endline>You're the reason why I want to give you everything, Beautiful<endline><endline>...Since you came into my life", "image": "https://images.genius.com/facf74257c67da04641635f3cd67e725.268x268x1.jpg"}, {"title": "Beauty In The Dark", "album": null, "year": null, "lyrics": "[Mos Def] (Isley Brothers)<endline>And ya know<endline>Yes you know<endline>Yes you know<endline><endline>My name Black Dante<endline>I cannot resist when you pass my way<endline>Your name Beauty In The Dark<endline>I'm staring through the fog trying to find where you are<endline>You got to take my hand<endline>You got to at least give me this one chance<endline>I've been waiting all night<endline>Don't be cruel girl it's only right<endline>I've been watching and waiting<endline>All night long<endline>And now they're playing this song<endline>And ya know<endline>And ya know<endline><endline>(I've been wanting to know)<endline><endline>You got to take my hand<endline>(Girl, speak yo' mind)<endline>And give me this one chance<endline>(Been thinking all of this time)<endline>I can see it in your eye<endline>(What I wouldn't do)<endline>And baby I don't mind<endline>(Oooh I)<endline><endline>It's a beautiful thing<endline>Especially when we can rock and swing<endline>When you're in my arms<endline>I'm smelling your hair and I'm feeling on your charms<endline>Baby please come close<endline>Don't let me go<endline>Baby hold me tight<endline>We can rock like this all night<endline>I've been watching and waiting<endline>All night long (so long)<endline>And know they're playing this song<endline>Oh baby baby<endline><endline>(And you know, you know)<endline><endline>My name Black Dante<endline>I cannot resist when you come my way<endline>Your name Beauty In The Dark<endline>I'm staring through the fog trying to find where you are<endline>You got to take my hand<endline>And baby at least give me this one dance<endline><endline>My name Black Dante<endline>(I've been watching, I've been watching)<endline>You are the Beauty In The Dark<endline>You got to take my hand<endline>And baby baby please give me just one chance<endline><endline>My name Black Dante<endline>I cannot resist when you pass my way<endline>(I wanna groove)<endline>Your name Beauty In The Dark<endline>I'm staring through the fog trying to find where you are<endline>(I wanna groove)<endline>You got to take my hand<endline>And baby baby please give me just one chance<endline><endline>I swear I do, I swear I do, I swear I do<endline><endline>My name Black Dante<endline>(I've been thinking, you've been thinking, thinking of me)<endline>You are the Beauty In The Dark<endline>(I wanna groove)<endline>You gotta take my hand<endline>And baby baby please give me this one chance", "image": "https://images.genius.com/e2a7b5317d43178e54b244c62fe068a2.500x500x1.jpg"}, {"title": "Beef", "album": null, "year": null, "lyrics": "Beef is not what Jay said to Nas<endline>Beef is when the working folks can't find jobs<endline>So they trying to find niggas to rob<endline>Trying to find bigger guns so they can finish the job<endline>Beef is when the crack babies can't find moms<endline>Cause they in a pine box, or locked behind bars<endline>Beef ain't the summer jam for Hot 9-7<endline>Beef is the cocaine and AIDS epidemic<endline>Beef don't come with a radio edit<endline>Beef is when the judge is callin' you defendant<endline>Beef: It come with a long jail sentence<endline>Handed down to you in a few short minutes<endline>Beef is when your girl come through for a visit<endline>To tell you that she pregnant, by some other nigga<endline>Beef is high blood pressure and bad credit<endline>Need a loan for your home but you're too broke to get it<endline>And all your little kids is doing is getting bigger<endline>You're trying not to raise 'em around these wild niggas<endline>Beef is when a gold digger got your seed in her<endline>A manicure handout like, \"Pay me nigga!\"<endline>Or I'm telling your wife<endline>Or starting up some foul rumor that'll ruin your life<endline>Beef is when a gangsta ain't doing it right<endline>And other gangstas is deciding what to do with his life<endline>Beef is not what these famous niggas do on the mic<endline>Beef is what George Bush would do in a fight<endline>Beef is what Ja said to 50<endline>But beef is all my homies not being here with me<endline>When a soldier ends his life with his own gun<endline>Beef is trying to figure out what to tell his son<endline>Beef is oil prices and geopolitics<endline>Beef is Iraq, the West Bank and Gaza Strip<endline>Some beef is big and some beef is small<endline>But what ya'll call beef is not beef at all<endline>Beef is real life happening every day<endline>And it's realer than them songs you gave to Kayslay<endline>This has been a real niggas P.S.A<endline>From Mos Def pretty flaco<endline>Black Dante<endline>And the Black Star Embassy B to the K!", "image": "https://images.genius.com/01cbfdcd59cbc20d1bd3e72bfc3a0379.500x500x1.jpg"}, {"title": "BET Cypher", "album": null, "year": null, "lyrics": "For sinners, saints and scramblers and gamblers<endline>And dirty money handlers, dignitaries and champions, narcotic traffickers<endline>Talented number runners and racketeers<endline>Stars of stage, page and cameras, slang swingers and swaggerers<endline>Double barrels and Derringers, automatics and miracles<endline>Europe, Asia, and Africa, all the time in America<endline>Atlantic, Ashland, Alblemarle to Albany<endline>Bridge into Baltic, Bedford Ave, Bergen Street<endline>Clinton to Cadman, Church Ave to Clarendon<endline>Road to Central Avenue, Cooper House, Cypress<endline>And live from Bedford-Stuyvesant<endline>The livest high flyingest pilot bombardier from Pyrrhus<endline>Stationed live and direct, Medina mastermind set<endline>Ya can't lock my set, now lock off, cool<endline>Peace to the nation of the Gods and the Earths<endline>And the Sun, Moon and Stars, furthermore born knowledge go hard<endline><endline>", "image": "https://images.genius.com/164584240120e0f841b3ed0390acedbe.480x360x1.jpg"}, {"title": "Body Rock", "album": null, "year": null, "lyrics": "Check me out y'all<endline>I'm in the lab with Ab, I got the pen and pad<endline>My man T-A-S-H take it to yo' breastplate<endline>It's the Mighty Mos Def, complete the trilogy<endline>Just shot myself a dime, see are you feeling me?<endline>Son I'm wicked and nice when I'm on facility<endline>Let me take a sec to review what I wrote<endline>.. \"Mos Def and does it sound far fetched?\" OK it's dope<endline>Let's record this ('cord this) they gonna award this (award this)<endline>And all area crew is gonna applaud this {*clapping*}<endline>And when we step to the plate Pah it's flawless<endline>My man T-A-S-H with styles glory great<endline>Great, great great, great great<endline><endline>[Tash]<endline>Up next we got CaTash with that West coast rhyming<endline>Bombing niggas with the style as dangerous as mountain climbing (ahhhhhhh)<endline>Cause the Alkie words I'm spitting be twisting while you listening<endline>Plus I'm in this motherfucker with the Likwit coalition (woo)<endline>That'll leave you in position, twisted backwards like yoga<endline>While you staring down my throat like, \"Is he drunk or is he sober?\"<endline>(Who knows?!) All I know is Tash got flows (woo)<endline>And got the technique to get the ladies out of they clothes<endline>I been overly exposed to the forty-oh's and chickens<endline>So I'mma keep it pumping til the beat stop kicking<endline>Or til the plot thickens, cause this is how we do<endline>CaTashtrophe, Mos Def, and the brother man Q!<endline><endline>[Q-Tip]<endline>What's up Tash, hey yo, Tip can't call it<endline>Sure as Mos is Def and you Alkaholik (right)<endline>I'mma be surfing at, thing that's worth dealing (uh-huh)<endline>Hypodermically, shoot up your feeling (uh)<endline>Figuratively speaking, of course, now (right)<endline>Old and greediness seeking it's course now (uh)<endline>What we gonna do? Eradicate them<endline>Shoot them from the jam, they be diseased phlegm<endline><endline>[Mos Def]<endline>Tash Love... are you ready to rock the mic?<endline>Q-Tip... are you ready to rock the mic!<endline>Mos Def... are you ready to rock the mic?<endline>We got the universal style that you got to like!<endline>And ain't nobody steppin up when we got the mic<endline>So turn the A.C. up cause it's hot tonight!<endline>And til the bright early morn' we be rockin you all<endline>Don't stop, the Body Rock!<endline><endline>[Tash]<endline>Cause I'm next to flex, and I'm technically advanced<endline>To turn you on like cybersex, so in less (uh) than two sec's (uh)<endline>I blind MC's like Thomas Dolby with the Science that'll leave<endline>They braincells fryin slowly (SCIENCE!) so slowly I flow and<endline>Express written consent, from the undergroundin niggas<endline>Coast II Coast I represent cause gettin bent, I do<endline>But I'm doper than sherm plus the way I put it down<endline>Could burn the perm off Big Worm, so peep this private screening<endline>Of the Last Action Hero that be freezin rappers dead in they tracks<endline>Like Sub Zero (Zero), cause Rico ain't no joke<endline>I eat yo' flows and yo' beat up rappers even feel my presence<endline>When I'm home with my feet up<endline><endline>[Mos Def]<endline>Yo what you skied up or treed up?<endline>Relax and pull a seat up, make your landlord turn the heat up<endline>Got the opposition shook like Tiger Woods about to tee up<endline>So niggas no competition with the clear Mos Definition<endline>MC's screamin now for years can't rhyme without they mom's permission<endline>You just a young'un comin out, gettin gassed to run your mouth<endline>Wildin on the Runabout, Baby Pah you comin out<endline>Barkin that you want a bout but son you know the comeabout<endline>When Mos Def blow up and, you don't, nuttin<endline>Don't you know nuttin? My crew go huntin<endline>We keep it on the norm then we transform som'in<endline>And while, we do it, you bounce to it<endline>The cops wanna stop the Body Rock (but don't do it)<endline><endline>[Q-Tip]<endline>DY-NO-MITE!!! Like Jimmy J.J<endline>Slobbed down pen-ny, somewhere in L.A. (A)<endline>Now we got to bond like Voltron (tron)<endline>Tash you the bomb, Mos you the won ton (ton)<endline>Q will pick the lead, I must drop on thee (thee)<endline>A-B-S, I bust down, facility (ty)<endline>T-R-A-C-T is the MC (cee)<endline>It's the LL, inside the place to be (be)<endline><endline>[Mos Def]<endline>Tash Love... are you ready to rock the mic?<endline>Q-Tip... are you ready to rock the mic!<endline>Mos Def... are you ready to rock the mic?<endline>We got the universal brothers that you got to like!<endline>Now ain't nobody steppin up when we got the mic<endline>So turn your A.C. up cause it's hot tonight!<endline>And til the bright early morn' we'll be rockin you all<endline>(Don't stop, the Body Rock!)<endline><endline>All my people out in Queens that know you're hot, you say<endline>(Don't stop, the Body Rock!)<endline>All my people out in Brooklyn and you know we're hot, say<endline>(Don't stop, the Body Rock!)<endline>Shaolin to L-I and you know we're fly, said<endline>(Don't stop, the Body Rock!)<endline>All the people on the Greens and the land in between said<endline>(Don't stop, the Body Rock!)<endline><endline>... no stoppin<endline>... no stoppin<endline>Out in Jersey ... no stoppin<endline>Philadelp-i-I ... no stoppin<endline>Chi Town gettin down ... the playgrounds<endline>Detroit USA ... no stoppin<endline>In Cali ... no stoppin<endline>And the great V-A ... no stoppin<endline>I sez, huh-huh huh-huh uh-huh-huh<endline>Cause in the Brooklyn town ... no stoppin<endline>And the Boogie Down ... no stoppin<endline>L-I and Queens ... no stoppin<endline>And you see Medina Greens ... no stoppin<endline>You know we, Lyricist Lounge ... no stoppin<endline>And my man Abstract ... no stoppin<endline>Except we never do wack ... no stoppin<endline>You don't stop, the Body Rock<endline>D-dah, don't stop", "image": "https://i.genius.com/5554e53400a95dc16ec86a4c9c5d1523de467b47?url=https%3A%2F%2Fhulkhatetimetravel.files.wordpress.com%2F2010%2F12%2Fbodyrock.jpg"}, {"title": "Brooklyn", "album": null, "year": null, "lyrics": "Hey hey, ha ha say what say what<endline>Ha ha bust it yo<endline>Sometimes I feel like I don't have a partner<endline>Sometimes I feel like my only friend<endline>Is the city I live in, is beautiful Brooklyn<endline>Long as I live here believe I'm on fire hey<endline>Cause it's the B-the-R-the-O-the-O-K<endline>L-Y-N is the place where I stay<endline>The B-the-R-the-O-the-O-K<endline>Best in the world and all USA<endline>It's the B-to-the-R-the-O-the-O-K<endline>L-Y-N is the place where I stay<endline>The B-to-the-R-the-O-the-O-K<endline>Place where I rest is on my born day<endline>Bust it, sometimes I sit back and just reflect<endline>Watch the world go by and my thought connect<endline>I think about the time past and the time to come<endline>Reminesce on Bed-Stuy when I was spry and young<endline>I used to try and come, to the neighborhood function<endline>Throw on my Izod, say a little something<endline>When I was just a youngin, before the days of thuggin<endline>How me and Charlie Chims, I'm only bugging<endline>Fast forward, nine now I gotta team my seed<endline>I must proceed at God's speed to perform my deed<endline>Livin the now space and time, round the nine to five<endline>For as long as I'm alive, paw I got to strive<endline>I ain't sittin roadside, that ain't part of the plan<endline>I'm out here for my fam doin all that I can<endline>I love my city, sweet and gritty in land to outskirts<endline>Nickname Bucktown cause we prone to outburst<endline>Philosophy redefine us, touch mines I touch back<endline>Walk the streets like a sweet and get beat like drum tracks<endline>Catch no shakes over jakes, we bust back<endline>Bring the marty to your face wit no place to run back<endline>I'm from the slums that created the bass that thump back<endline>This ain't a game clown, play ya James Brown and jump back<endline>What you want, Jack? Young cats stash they jums at<endline>Draw they guns back, momma screams where she sons at<endline>Tryin to hunt that, recurring dream of high stakes<endline>The fourth largest, first hardest, Brooklyn is the place<endline>Settled by the Dutch many years ago<endline>Three billion strong and here we go<endline><endline>Good MORNINNNNNNNNNGG Vietnam<endline>(We're made in Brooklyn baby X2)<endline>Yo sometimes I sit back, reflect on the place that I live at<endline>Unlike any place I ever been at<endline>The home of big gats, deep dish hammer rim caps<endline>Have a mishap, push your wig back<endline>Where you go to get the fresh trim at<endline>Fulton and Jay got the Timb rack<endline>Blue collars metro carding it<endline>Thugs mobbing it, form partnership<endline>Increase armament, street pharmacist<endline>Deep consequence, when you seek sleek ornaments<endline>You get caught, rode the white horse and can't get off<endline>Big dogs that trick off just get sent off<endline>They shoebox stash is all they seeds gotta live off<endline>It's real yo but still yo, it's love here<endline>And it's felt by anybody that come here<endline>Out of towners take the train, plane and bus here<endline>Must be something that they really want here<endline>One year as a resident, deeper sentiment<endline>Shout out \"Go Brooklyn\", they representing it<endline>Sitting on their front stoop sipping Guinnesses<endline>Using native dialect in they sentences<endline>From the treeline blocks to the tenements<endline>To the Mom and Pop local shop businesses<endline>Travel all around the world in great distances<endline>And ain't a place that I know that bear resemblance<endline>That's why we call it The Planet<endline>Not a borough or a prov, it's our style that's uncommon<endline>From Sumner to Tompkins to Lafayette Gardens<endline>Wyckoff, Gowanus, in their army jacket linings<endline>Yo, this goes out to my cats in Coney Isle<endline>Friday night out in front The Himalaya going wild<endline>This goes out to Crown Heights and Smurv Village<endline>The 90s, and all my yarda trini Brown's Village<endline>Parkside tennis courts, thirties, forties, and the fifties<endline>The cats out in Starrett City getting busy<endline>To the Hook, to the East, to the Stuy<endline>Bushwick and Canarsie<endline>Farragut, Fort Greene, and Marcy<endline>My Flatbush posse, generals of armies<endline>When it's time to form, just call me<endline>And let this song be playin loud in Long B<endline>If you love Bucktown strongly<endline>Raise it up<endline><endline>Brooklyn my habitat, the place where it happen at<endline>Live sway and the sharp balance of the battle axe<endline>Irons is brandished at, thugs draw they hammer back<endline>It's where you find the News Two crew cameras at<endline>It's where my fam is at, summertime jam is at<endline>They play Big and get you open like a sandal back<endline>Hotter than candle wax, hustlin' you can't relax<endline>The crack babies tryin to find where they mamas at<endline>It's off the handle black, with big police scandals that<endline>Turn into actions screenplays sold to Miramax<endline>The type of place where they check your appearance at<endline>And cats who know where all the hot 'lo gear is at<endline>The stompin' grounds, where you find a pound of smoke is at<endline>Be blazin' John that have your wave cap floatin' back<endline>The doorstep where the disposessed posted at<endline>Dope fiends out at Franklin Ave sellin' Zovirax<endline>You big balling, better keep your money folded back<endline>Cause once the young guns notice that it's over, black<endline>Brooklyn keep on takin' it, worldwide we known for that<endline>Flossy cats get it snatched like the local tax<endline>The place I sharpen up my baritone vocals at<endline>Where one of the greatest MCs was a local cat", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}, {"title": "Brown Sugar (Fine)", "album": null, "year": null, "lyrics": "[Mos Def]<endline>(if you invited me)<endline>Yeah, Cav Love, brown sugar<endline>Bout to set it like, yeah yeah y'all (uh huh)<endline>Yeah yeah y'all (uh huh) yeah yeah y'all (uh huh)<endline>(if you invited me)<endline>Adjust my mic so I can touch it up right quick<endline>Show 'em how Brooklyn do, you know what I mean? (no doubt)<endline>Listen, yo<endline><endline>Let's start it up (start it up)<endline>Let's get it flowin (get it flowin)<endline>Let's make a move (make a move)<endline>Let's get it goin (haha)<endline>I know it's feelin like everything you want, don't it?<endline>And you been waitin your whole life for one moment<endline>Well baby here it is (here it is)<endline>You better step to it (step to it)<endline>I know you ready right (ready y'all)<endline>Then baby let's do it (let's do it)<endline>Put your neck to it, put your arms and legs next to it<endline>Then put whatever else is left to it<endline>See you're all in (all in) now you about to rock 'em<endline>Got your focus man, now they got a problem<endline>Who you talkin to? son right there<endline>The man in the mirror, I see him quite clear<endline>Do your thing Cav (yeah son)<endline>Work it out dog (work it out)<endline>Open up their minds (open up)<endline>Be about yours (bout yours)<endline>Silence everyone who ever try to doubt yours<endline>Get your mind right (mind right)<endline>Keep your sound raw (sound raw)<endline>Heavy bass man (bass man)<endline>Make it bounce more (bounce more)<endline>Make 'em feel it from to the ceilin to the ground floor<endline>(if you invited me)<endline>How it sound y'all? I know it's crazy, right<endline>I know it's crazy tight, don't ever take me light<endline>It's Cav Love y'all (Cav Love y'all)<endline>And that's what's up y'all (sup y'all)<endline>I peeped in, I know exactly what you want y'all<endline>I make it jump y'all (jump y'all)<endline>So put 'em up y'all (up y'all)<endline>Brown Sugar, Brooklyn, it's bout to jump off<endline><endline>[Mos Def]<endline>It's like one, two, three, and to the four<endline>The brother Cavvy Cav is here so let him know<endline>This for my hustlers (my hustlers)<endline>This for my scramblers (scramblers)<endline>This for my sexy mamis (sexy mamis)<endline>This for everybody (everybody)<endline>Bang it at any party and watch 'em rock to it<endline>Bounce some pop to it, this here's hot music<endline>Duke I'm not losin, you need to stop foolin<endline>I know the game very well boy I'm not stupid<endline>Sharp and smart movement, applyin a heart to it<endline>Came here to get the ghetto blocks movin<endline>(if you invited me)<endline>And after rockin in the porch and backyards movin<endline>Keep it crackin cuz I love the way that y'all do it<endline><endline>Damn baby, damn baby, damn baby, damn<endline>Ooh ahh, ooh ahh ooh ahh<endline>Ooh ahh, ooh ahh ooh ahh<endline>Damn baby, damn baby, damn baby, damn baby<endline>Ooh ahh, ooh ahh ooh ahh<endline>Ooh ahh, ooh ahh ooh ahh<endline>Damn baby, damn baby, damn baby, damn baby<endline>Ooh ahh, ooh ahh ooh ahh<endline>Ooh ahh, ooh ahh ooh ahh<endline>Damn baby, damn baby, damn baby, damn baby<endline>If you invited me<endline>If you invited me", "image": "https://images.genius.com/ddd86fe38c4273dea84aef9a607c4d17.500x500x1.jpg"}, {"title": "Casa Bey", "album": null, "year": null, "lyrics": "[Mos Def]<endline>\"Boogie Man\"<endline>Magnetic, the flows are athletic<endline>Dimensions are perfected<endline>But the static and kinetic is power<endline>Past pressure, and mass beyond measure<endline>You can place son where ever, he... \"Don't stop\"<endline>Magnetic, the flows are athletic<endline>Dimensions are perfected<endline>But the static and kinetic is power<endline>Past pressure, and mass beyond measure<endline>You can place son where ever, he Bed-Stuy \"Boogie Man\"<endline>Magnetic, the flows are athletic<endline>Dimensions are perfected<endline>But the static and kinetic is power<endline>Past pressure, and mass beyond measure<endline>You can place son where ever, he... \"Thank you and thank you very kindly\"<endline>Magnetic, the flows are athletic<endline>Dimensions are perfected<endline>But the static and kinetic is power<endline>Past pressure, and mass beyond measure<endline>You can place son where ever, he Bed-Stuy forever<endline><endline>The fresh, the author and associates are proud to present<endline>M-Def the Black, fantastic raw<endline>Dynamic, true Ecstatic, ghetto outstanding<endline>Classic active every place, I have<endline>The skill, power, passion, raise your red lantern<endline>Stanzas and anthems based on expansion<endline>A vantage point of the past, present and after<endline>Rapture, mastered the ceremonial master craft<endline>Of the masterminds who craft masters<endline>Master and viber from Brooklyn Island<endline>Legendary asylum, Black Star shining<endline>Bedford-Stuyvesant isn't Strivers<endline>Flatbush blazing like it's smoke of the prophet<endline>And it's constant, remarkable artwork<endline>And God is the author, from Flaco to Archer<endline>We right on target, a ready steady responsive<endline>A black light bright in the darkness, y'all just<endline>A fantastic rawness, good morning, yes<endline><endline>You are rocking with the fresh<endline>You are rocking with the fresh<endline>You are rocking with the Def<endline>With a kiss...<endline>Hah, ye-hee-hes<endline>Right now on it alwaaaaays...<endline>Soul shocking, never stopping<endline>Always keep the beat rock<endline>Hah, ye-he-he-heees...<endline>Ye-hee-he-hes...<endline>Right now on it alwaaaaays...<endline><endline>Play on all digits<endline>You know you can't stop my go<endline>You can't stop my go<endline>Born to be who I am<endline>(Been born to be who I am)<endline>Bright light from a distant star<endline>(Bright light from a distant star)<endline>Miracles, answered prayers<endline>(Miracles, answered prayers)<endline>Huh, all in together now<endline>You can't stop my go<endline>I've been born to be where I am<endline>A bright light from a distant star<endline>Miracles and answered prayers<endline>You can't stop my go<endline>I've been born to be where I am<endline>Mos light from a distant star<endline>Miracles and answered praaaaaayers...<endline><endline>Yes, ye-hee-hees...<endline>Right now on it alwaaaaays...<endline>Soul shocking, never stopping<endline>Always keep the beat on rock<endline>Hah, ye-he-he-heeees...<endline>Hah, ye-he-heees...<endline>Right now on it always<endline>Author and associates are proud to present<endline>Static rhythms of Boogie Man productions<endline><endline>Don't stop the rock<endline>You don't, don't stop the rock<endline>You don't, don't stop the rock<endline>You don't, don't stop the rock<endline>You hear the people say \"Don't stop\"<endline>Don't stop the rock<endline>You don't, don't stop the rock<endline>You don't, don't stop the rock<endline>You don't, don't stop the rock<endline>You hear the people say \"Don't stop\"<endline><endline>{*Repeat 5X to fade*}<endline>You can't stop my go<endline>I've been born to be where I am<endline>Bright light from a distant star<endline>Miracles \"Don't stop\"", "image": "https://images.genius.com/b13acc0fe75405f9fde88d9e60c03a7a.640x640x1.jpg"}, {"title": "Classic Freestyle", "album": null, "year": null, "lyrics": "Slim brown skin I be<endline>Standin' 5'10\" I be<endline>Rockin' it when I be in your vicinity<endline>Raw style synergy recognize<endline>Symmetry constant to the edge of me<endline>Broken down chemically<endline>Ain't another ten emcee talkin' 'bout<endline>How been I be, styled like Kennedy<endline>Late like a ten-to-three<endline>When I say, when I be, girls say: \"ven aquí\"<endline>Cause they tend to be way out like Tennessee<endline>Take me to a place called the BK<endline>Without pause or delay, yet run like Penn Relay<endline>Don't deal with he-say-she-say<endline>Ain't workin' for no cheap, pay the Mos Def beat play<endline>This is what the streets say<endline>Hey, mr. DJ: play that devil Mo'Gain<endline>That jam got me open<endline>Beside to break it broken from<endline>Front, front side to side, middle to back<endline>Never the wack, I come from Bedstuy, black<endline>From Louis A-V-E to be exact<endline>Brooklyn! Brooklyn!", "image": "https://images.genius.com/2d51da35b3bc7a5b97383006960f6a8b.400x400x1.png"}, {"title": "Climb", "album": null, "year": null, "lyrics": "La La La [humming...]<endline><endline>People climbed into the night like space suits<endline>People stepped into the night like moon boots<endline>Marching like moon troops<endline>In their soot colored zoot suits<endline><endline>People climbed into the night like cool wells<endline>Shiney bottles in their hands<endline>Drinking their new selves<endline>They say it's their true selves<endline><endline>People climbed up in the night like green trees<endline>They were hanging from the night like green leaves<endline>Buzzing like queen bees<endline><endline>People climbed into the night like space suits<endline>People stomped inside the night<endline>Stomping and stomping and stomping and stomping and stomping<endline><endline>Where are they going?<endline>What's the rush?<endline>Everybody in the place was so out of touch<endline>Hey<endline><endline>Night-time is when the things get heavy<endline>You feel alone and you want somebody<endline>Loneliness whispers desperate measures<endline>And your frantic all by yourself<endline><endline>Night-time is when the things get heavy<endline>You feel alone and you want somebody<endline>Loneliness whispers desperate measures<endline>Baby don't make no fast moves<endline>Baby don't make no fast moves<endline>Baby don't make no fast moves<endline>Baby don't make no fast moves- Tonight<endline><endline>La La La [humming...]<endline><endline>People stomped inside the night<endline>Let me climb into the night...<endline>Let me climb...<endline>[Vamp to fade]", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}, {"title": "Close Edge", "album": null, "year": null, "lyrics": "Pull up to your spot on low<endline>Shine brighter than all of they cats that got on glow<endline>Lay in the cut like they not gon' know<endline>Cause if I gotta make a move dog they not gon' know<endline>This door marked private this is not fo' show<endline>It's Mos Def what you call real fo' sure<endline>Is they what you call gangster, hell no<endline>They get a little pinch and go snitch to the po'<endline>They all talk fast and they all think slow<endline>I'm Mos Definite, not think so<endline>Flood your city with the black ink flow<endline>And my crew ain't scared to let them things go<endline>So, stop with the nonsense, like he conscious<endline>I'm just awake dog, I'm doing great dog<endline>I don't play games so I don't playa hate y'all<endline>Get it straight or get the fuck up out my face dog<endline>I'm like the second plane that made the tower's face off<endline>That shit that let you know it's really not a game dog<endline>Your grind and my grind ain't the same dog<endline>I'm the catalogue, you the same song<endline>So cool and old school like eight-four<endline>The one your little mami winding up her waist for<endline>The name that real niggas got they hand raised for<endline>Me and Mini got your block yellow taped off<endline><endline>Don't push me cause I'm close<endline>To the edge, back, middle, and front<endline>Strong back shit lifting it up<endline>From the big and the small<endline>I'm like J. Brown getting involved<endline><endline>And when I'm letting off a round don't get in the cross<endline>Have your preacher man speaking low getting his cross<endline>Tell a wild cowboy not to get off they horse<endline>Before they find out the town law is strictly enforced<endline>It's a real bad way to get your name in the Source<endline>Testing the limits of a dangerous force<endline>You ended up dumb, famous and gone<endline>Your people shouting out your name in they song<endline>Pouring liquor on the day you was born<endline>Buying paint to put your face on a wall<endline>C'mon fall back, there's no need for all that<endline>It's all good, we all here, going all out<endline>All live, all day, listen when the song say<endline><endline>", "image": "https://images.genius.com/338419572381e746b5f1aa0866d2d857.596x596x1.jpg"}, {"title": "Do It Now", "album": null, "year": null, "lyrics": "Yes, the first cut should be the deepest<endline>To penetrate beyond the muscle wall's inner regions<endline>First you was icing me, connect with the staring at the speakers<endline>Heard the rhyme, head high, what ya starin at ya sneakers<endline>You shy now, got a lot of things on your mind now<endline>You don't feel fly now, you hunting the exit sign down<endline>Fuck what you heard, cause I snatch the grapevine down (yea yeah)<endline>Don't understand how I ran the line down? Rewind now<endline><endline>Ay dios mio, me and Bustarimo muy peligro<endline>The two hottest negroes en Los Estados Unidos<endline>Hotter than Reno when discovered by Bugsy Siegel<endline>I'm black like Don Cheadle shoutin power to the people<endline>My rhymes dipping like the lifeline on the e-boat<endline>The raw sugar cane, NutraSweet, never Equal<endline>If you in a Benzito or your mother's Buick Regal<endline>I get up like Chino shoutin power to the people<endline><endline>From east, west, north, and south, I got joints for all of those<endline>Heavy aquatic water flows keepin them on they toes<endline>Tell them thugs that wanna be CEO's to be derobed<endline>'Fore I wear your little dumb ass out like Easter clothes!<endline><endline>Watch out, your pussy sound get bucked south<endline>Mos and Busta Rhymes too bad man-a-shutout<endline>Watch out, give a damn what fancy car ya hop out<endline>Shut down your game like the NBA lockout<endline><endline>", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}, {"title": "Fear Not of Man", "album": null, "year": null, "lyrics": "[Spoken]<endline>Bismillah ir Rahman ir Raheem<endline>If you can hear me ladies and gentlemen<endline>Then I'm very happy that you came here<endline>Ooh-oooh, whee!<endline>That was for Brooklyn<endline>Ha ha, we get it every time<endline>You got me on? Oh<endline>Shout out to all of my crew, East-West, North-South<endline>All the continent, Europe, all abroad international<endline>Bring it in, bring it in, bring it in, bring it in<endline>It's a lot of things goin' on y'all<endline>21st century is comin'<endline>20th century almost done<endline>A lot of things have changed<endline>A lot of things have not, mainly us<endline>We gon' get it together right? I believe that<endline>Listen—people be askin' me all the time<endline>\"Yo Mos, what's gettin' ready to happen with hip-hop?\"<endline>(Where do you think hip-hop is goin'?)<endline>I tell em, \"You know what's gonna happen with hip-hop?<endline>Whatever's happening with us\"<endline>If we smoked out, hip-hop is gonna be smoked out<endline>If we doin' alright, hip-hop is gonna be doin' alright<endline>People talk about hip-hop like it's some giant livin' in the hillside<endline>Comin' down to visit the townspeople<endline>We are hip-hop<endline>Me, you, everybody, we are hip-hop<endline>So hip-hop is going where we going<endline>So the next time you ask yourself where hip-hop is going<endline>Ask yourself: where am I going? How am I doing?<endline>Till you get a clear idea<endline>So if hip-hop is about the people<endline>And the hip-hop won't get better until the people get better<endline>Then how do people get better? (Hmm)<endline>Well, from my understanding people get better<endline>When they start to understand that they are valuable<endline>And they not valuable because they got a whole lot of money<endline>Or 'cause somebody, think they sexy<endline>But they valuable 'cause they been created by God<endline>And God makes you valuable<endline>And whether or not you recognize that value is one thing<endline>You got a lot of societies and governments<endline>Tryin' to be God, wishing that they were God<endline>They wanna create satellites and cameras everywhere<endline>And make you think they got the all-seeing eye<endline>Eh, I guess The Last Poets wasn't too far off<endline>When they said that certain people got a god complex<endline>I believe it's true<endline>I don't get phased out by none of that, none of that<endline>Helicopters, the TV screens, the newscasters, the satellite dishes<endline>They just wishing<endline>They can't really never do that<endline>When they tell me to fear they law<endline>When they tell me to try to have some fret in my heart behind the things that they do<endline>This is what I think in my mind<endline>And this is what I say to them<endline>And this is what I'm saying to you check it<endline><endline>", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}, {"title": "Ghetto Rock", "album": null, "year": null, "lyrics": "Like - Hot<endline>The haters can't fuck with it<endline>Cause they mom and they sister and girl in love with<endline>It (and they niggas)<endline>Sound man holla black COME WITH IT<endline>Sping the record 'till the record done spinning<endline>Up top is you getting up with it?<endline>Dirty dirty is you getting cronk with it?<endline>Smokey smoke from coast to coast<endline>Be carefull our first draw be that overdose<endline>Who stay holding it from Brooklyn? YOU KNOW IS MOS!<endline>Ha, Jackpot I (Sing yo) got to go for broke<endline>Is this the only way the Smith Family now to go<endline>Right here to my youngest one is older folks<endline>Im'ma put down like a dirty so and so<endline>Freak daddy came here to work the mojo - oh<endline>Because the - high is high and the low is low<endline>And that goes for the sinner man to holy folks<endline>Put your shit in the sky like I know you - oh<endline>[Brooklyn stand up!]<endline>Ha, my ghetto nation get toe to toe<endline>Stay rocking steady steady cause I told you so<endline>And after y'all get it go I let it go some more<endline>That Black Jack about something for sure) for sure<endline>[SAY WHAT!]<endline>For sure for sure [HA!]<endline>Let me see you in the world making your shoulder role<endline>And if it get good tell your nigga throw your 'bows<endline><endline>Ha, I am a fighter and a lover<endline>I'm the freaky baby daddy, I'm a bad motherfucker<endline>I'm the earth, wind, fire, and the thunder<endline>I said I am, go ask my mother<endline>You don't believe that shit believe what you want to<endline>Alright, OK, So, Shut-up!<endline>Speak language come straight from the gutter<endline>Observe the terms that we trade with one and other<endline>Like - what's good, what's popping, what's cracking<endline>What it is, how you living, what's happening<endline>Work songs that the slaves sang back then<endline>The playground chants, with little girls claping<endline><endline>", "image": "https://images.genius.com/338419572381e746b5f1aa0866d2d857.596x596x1.jpg"}, {"title": "Got", "album": null, "year": null, "lyrics": "This one goes to all them Big Will cats<endline>With ice on they limbs and big rims on they Ac<endline>You goin' around town with your system bump<endline>And your windows cracked low to profile and front<endline>Now I like to have nice things just like you<endline>But I'm from Brooklyn, certain shit you just don't do<endline>Like, high postin' when you far from home<endline>Or like, high postin' when you all alone<endline>Now, this would seem to be clear common sense<endline>But, cats be livin' off, sheer confidence<endline>Like \"Fuck that, picture them tellin' me run that\"<endline>But acting invincible, just ain't sensible<endline>It's nineteen ninety-now, and there's certain individuals<endline>Swear they rollin' hard and get robbed on principle<endline>5 star general, flashin' on your revenue<endline>You takin' a ride on the Downstate medical, Like (whooooooo)<endline>Colorful sparks, yellow and blue<endline>A full on attack and it's happening to you<endline>Wit' nothing you can do but bust back and cop a plea<endline>But five of them and one of you, that equals Got to me<endline><endline>Come on ya'll now, let's be real<endline>Some jokers got a rough time keepin' it concealed<endline>I wonder what it mean, it's probably self-esteem<endline>They fiendin to be seen, get hemmed like Gabardines<endline>Cats think it can't happen until the gats start clappin<endline>They comin' down the wire spittin fire like a dragon<endline>Cause while the goods glisten, certain eyes take position<endline>To observe your trickin', then catch that ass slippin'<endline>Like, come on now ock, what you expect?<endline>Got a month's paycheck danglin' off your neck<endline>And while you Cristal sippin', they rubbin' up they mittens<endline>With heat in mint condition to start the getti-gettin'<endline>They clique starts creepin' like Sandinista guerrillas<endline>You screamin' playa haters, these niggas is playa killers<endline>Mr. Fash-ion, that style never last long<endline>The harder you flash, the harder you get flashed on<endline>There's hunger in the street that is hard to defeat<endline>Many steal for sport, but more steal to eat<endline>Cat's heavy at the weigh-in, and he's playin' for keeps<endline>Don't sleep, they'll roll up in your passengers seat<endline>There is universal law, whether rich or poor<endline>Some say life's a game, to more, life is war<endline>So put them egos to the side and get off them head trips<endline>'Fore some cats pull out them heaters and make you headless<endline><endline>", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}, {"title": "Habitat", "album": null, "year": null, "lyrics": "(Chorus)<endline><endline>We all got to have, a place where we come from<endline>This place that we come from is called home<endline>We set out on our travels, we do the best we can<endline>We travel this big earth as we roam<endline><endline>We all got to have, a place where we come from<endline>This place that we come from is called home<endline>And even though we may love, this place on the map<endline>Said it ain't where ya from, it's where ya at<endline><endline><endline>I come up in the street around some real wild brothers<endline>With more than one name and more than one baby mother<endline>More than one case, been on more than one run<endline>Got more than one enemy and more than one gun<endline>Partner, all that's left to want is more<endline>While these cats that's less privileged is just more raw<endline>Less space cause the projects laced with more flaws<endline>Less sleep cause the nights ain't peace, it's more war<endline>The can is raw like thirsty, rainy season thunder claps<endline>On the block with your old pop pleading number act<endline>To the spot with the red top fiends is huddled at<endline>To the crib where the little kids spend their summers trapped<endline>With the jungle cats, lions and tigers, leopards and cheetahs<endline>For gazelle you get chased like a zebra, they blaze cheeba-cheeba<endline>And dominate the weaker on the street<endline>Hungry bellies only love what they eat and it's hard to compete<endline>When they smile with your heart in they teeth<endline>And the odds is stacked high beyond and beneath<endline>Son I been plenty places in my life and time<endline>And regardless where home is, son home is mine<endline><endline>Some people live out in-New York City<endline>Some people live out in-Atlanta<endline>Some people got to live-Chicago<endline>Some people do live-Miami<endline>All my people at-California<endline>And other people got to live-London<endline>And everybody got to live in the whole big world<endline>Together just you and me<endline><endline><endline>When I think of home, my remembrance of my beginning<endline>Laundromat helping ma dukes fold the bed linen<endline>Chillin in front my building with my brother and them<endline>Spending nights in Bushwick with my cousins and them<endline>Wise town and Beat Street, federal relief<endline>Slowly melting in the morning grits we used to eat<endline>Sticking to your teeth and teeth is hard to keep<endline>With every flavor Now & Later only a dime apiece<endline>Old timers on the bench playing cards and thangs<endline>Telling tales about they used to be involved in things<endline>Start to drinking, talking loud, cussing up and showing out<endline>On the phone, call the cops, pick'em up, move'em out<endline>And it's all too common to start wildin<endline>I'm a pirate on an island seeking treasure known as silence<endline>And it's hard to find<endline>Block parties in dark lobbies<endline>Funeral homes packed but only dark bodies<endline>I can't sleep hardly, stirred up like Bob Marley<endline>Marley Marl played the symphony, remember we recall<endline>Son I been to many places in my space and time<endline>And whatever my home is, son home is mine<endline><endline>", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}, {"title": "Hip Hop", "album": null, "year": null, "lyrics": "My restlessness is my nemesis<endline>It's hard to really chill and sit still, committed to page<endline>I write a rhyme, sometimes won't finish for days<endline>Scrutinize my literature from the large to the miniature<endline>I mathematically add-minister, subtract the wack<endline>Selector, wheel it back, I'm feeling that<endline>From the core to the perimeter black<endline>You know the motto, stay fluid even in staccato (Mos Def)<endline>Full blooded, full throttle<endline>Breathe deep inside the drum hollow... There's the hum<endline>Young man, where you from? Brooklyn number one!<endline>Native son, speaking in the native tongue<endline>I got my eyes on tomorrow (there it is)<endline>While you still tryin to find where it is<endline>I'm on the Ave where it lives and dies, violently but silently<endline>Shine so vibrantly that eyes squint to catch a glimpse<endline>Embrace the bass with my dark ink fingertips<endline>Used to speak the King's En-ga-lish<endline>But caught a rash on my lips, so now my chat just like dis<endline>Long range from the base-line (swish)<endline>Move like an apparition, float to the ground with ammunItion<endline>(Chi-chi-pow) Move from the gate, voice cued<endline>On your tape, putting food on your plate<endline>Many crews can relate, who choosing your fate (yo)<endline>We went from picking cotton<endline>To chain gang line chopping, to Be-Bopping, to Hip-Hopping<endline>Blues people got the blue chip stock option<endline>Invisible man, got the whole world watching<endline>(Where ya at?) I'm high, low, east, west, all over your map<endline>I'm getting big props, with this thing called hip hop<endline>Where you can either get paid or get shot<endline>When your product in stock, the fair-weather friends flock<endline>When your chart position drop, then the phone calls....<endline>Chill for a minute, let's see who else hot, snatch your shelf spot<endline>Don't gas yourself, akh'<endline>The industry just a better built cell block<endline>A long way from the shell tops<endline>And the bells that L rocked (rock, rock, rock, rock...)<endline><endline>Hip Hop is prosecution evidence<endline>An out of court settlement, ad space for liquor<endline>Sick without benefits (hungh!) Luxury tenements<endline>Choking the skyline, it's low life getting tree-top high<endline>It is a back water remedy<endline>Bitter and tender memory, a class E felony<endline>Facing the death penalty (hungh!)<endline>Stimulant and sedative, original repetitive<endline>Violently competitive, a school unaccredited<endline>The break beats you get broken with on time and inappropriate<endline>Hip Hop went from selling crack to smoking it<endline>Medicine for loneliness remind me of Thelonius and Dizzy<endline>Propers to B-Boys getting busy<endline>The war-time snap shot, the working man's jack-pot<endline>A two dollar snack box sold beneath the crack spot<endline>Olympic sponsor of the black Glock<endline>Gold medalist in the back shot<endline>From the sovereign state of the have-nots<endline>Where farmers have trouble with cash crops (woooo)<endline>It's all-city like Phase 2<endline>Hip Hop will simply amaze you, praise you, pay you<endline>Do whatever you say do, but, black, it can't save you", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}, {"title": "History", "album": null, "year": null, "lyrics": "I was born in a season where the world was quiet and cold<endline>Celebrations were going on<endline>Some were happy, some were sad<endline>Some felt bad from being good<endline>Some felt good from being bad, feelings pass and change<endline>But they never leave, they here to stay<endline>Holiday, holiday, happy birthday<endline>Teenage love, the first cut run deep<endline>Soul on flesh, this is the Brooklyn streets<endline>Year of the Ox, seven and three<endline>M.D., the history (come on)<endline>Every soul's got one of these (yes)<endline>It's where you been and where you be<endline>And without understanding you cannot proceed<endline>Complete, the start and the end<endline>Then it just go round again<endline><endline>", "image": "https://images.genius.com/b13acc0fe75405f9fde88d9e60c03a7a.640x640x1.jpg"}, {"title": "I Don’t Like", "album": null, "year": null, "lyrics": "Got us strapped up in the system, man I don't like<endline>Ain't too different from a prison jacket, ain't right<endline>Ain't no freedom at the trap, hustlers everywhere<endline>You could feel it in the air, pure despair<endline>Hungry hands only take when they reaching out<endline>Campaign, smoking, geek up, gun pow<endline>Ugly politicians, new election year<endline>Crying bout their care, they are not sincere<endline>It's the greedy and the rich ones that make war<endline>That the hungry, young, and poor ones paid for<endline>The little homie stretched out in a coffin<endline>They dying younger, and they dying more often<endline>The rent too high, the wage too low<endline>The top five stupid songs up on your radio, nah!<endline>I don't like (I don't like)<endline>All this cackling and caring on, I don't like<endline>All this sucka-ness and scary shit I don't like<endline>All these Afri-coon Americans, it ain't right<endline>And that goes to crazy-ass crackers<endline>Small claim corp. clowns, and strip club rappers<endline>Out in broad day with they nipples out<endline>With they stretch marks, blackheads and pimples out<endline>Yuck, you suck, go away<endline>You're always talking, and you never got much to say<endline>Yuck, you suck, go away<endline>You're always crowding space, fix your thirsty face, nah!<endline>I don't like, I don't like<endline>The way your shoulders looking sound, I don't like<endline>The way I see 'em getting down, I don't like<endline>Make you wonder how they get around, it ain't right<endline>In the land where crooks get to write the laws<endline>But people hide their eyes, and shut their jaws<endline>Who the realest? Never mind<endline>Who doing it for the best, there ain't lies<endline>What they wearing, who is there?<endline>Ask yourself, why you care?<endline>Somebody going ham on a gossip site<endline>Catching feelings over rumors that are not your life<endline>I don't like, sometimes I even hate<endline>But not the people, they acts and ways<endline>I don't like, sometimes I even hate<endline>Lord forgive, let us pray<endline>For pussy posers, dummy greed<endline>Polluted seas, them wacky weeds<endline>Nazi po-lice, wasted time<endline>Zombie recruitment, legal crime<endline>I don't like<endline>You don't like it neither<endline>You said...<endline>Rebuke, forgive, and pray for these fake niggas", "image": "https://images.genius.com/ce0e2c6d6ae9fec90c32c39501778107.557x557x1.jpg"}, {"title": "I’m Leaving", "album": null, "year": null, "lyrics": "Well go'head and leave<endline>The call heard around the world from the wives of MCs<endline>These cats is paying more than half a pound<endline>My garment bag'll snatch it down<endline>Ain't got the skate, but we can probably run it back in town<endline>Scenarios like this is tear jerkers<endline>For the modern emcee, ie. the blue collar worker<endline>Cause this thing called rhyming, no different from coal mining<endline>We both on assignment, to unearth the diamond<endline>While you start climbing in 'em, I start shining<endline>You be struggling and striving<endline>And they think you prime timing<endline>Maintain and keep silent<endline>Make note and observation<endline>This confrontation<endline>This is the daily operation<endline>My concentration<endline>Stay focused on my recitation<endline>Bout to reach my destination<endline>With no pause or hesitation<endline>Baby make the preparation<endline>Cause this ain't no recreation<endline>This is pro-ball<endline>And we lettin' you know y'all<endline>At the show y'all<endline>Doing this for dough y'all<endline>Get the phone call<endline>And I'm ready to blow y'all<endline>Bout to go y'all<endline>Been a pleasure to know y'all<endline>And I'm lettin' you know that<endline><endline>But God willing I'll be back home<endline>To drop these heavy ass bags up off my back bone<endline>Around the world with a catalogue of rap songs<endline>My baby girl is walking, been away for that long<endline>But no you haven't well at least that's how it seem to me<endline>My hometown is like a whole different scenery<endline>The old timers on the stoop leaning leisurely<endline>The new jacks up in the parks smoking greenery<endline>Easily take it for granted when you up in it<endline>But it's sweet scented, when you been down for a minute<endline>Move around city limits, break 'em down with the vinitage<endline>The inovinin', classical b-boy image<endline>Collect the winnings<endline>Cause it the reason that we came here<endline>This thing is not a game here<endline>The fortune not the fame here<endline>From New York to the Cackalacks<endline>Cali and the Cadillacs<endline>Chicago no we innovate<endline>Infiltrate Virginia state<endline>DC make me stimulate<endline>Philly know we penetrate<endline>Georgia make us generate<endline>Let's set a date to get the papes<endline>They celebrate to my jams in foreign lands<endline>Even your mans in Japan know who I am<endline>Mina-san, make everybody out in Nippon<endline>Say ichiban, me God man bo where you hitting from<endline>Phenomenon<endline>Scuse me that's a phone call<endline>It's a show y'all<endline>Trying to get this dough y'all<endline>Bout to blow y'all<endline>Been a pleasure to know y'all<endline>And I'm lettin' you know<endline><endline>Shake your money maker<endline>Shake your money maker<endline>Shake your money maker<endline>Move your money maker<endline>Move your money maker", "image": "https://images.genius.com/3e321abb905d27220d9c5bebd32f9cab.612x612x1.png"}, {"title": "Kalifornia", "album": null, "year": null, "lyrics": "{*singing*}<endline>This is the place... where you say<endline><endline>{*talking*}<endline>People come from far, far, far away to find their dreams<endline>Chasin' down these meteors and comets<endline>(chasin' 'em, chasin' 'em, chasin' 'em down)<endline>Called dreams, in the sky of life<endline>(chasin' 'em, chasin' 'em, chasin' 'em down<endline>Chasin' 'em, chasin' 'em) There certain hot spots<endline>Where these meteors and stars have tendency to fall<endline>And legend has it that California is one of those spots<endline>I believe that to be true<endline><endline>{*singing*}<endline>They say this is the place stars are born<endline>They say this is the place (place) legends are made<endline>They say this is the place where angels come again, ay ay<endline>They say that this is the place where it all can happen for you<endline>(for you, for you, for you)<endline>California knows how to make dreams seem so sweet<endline>California knows how to-<endline>Whisper in your ear and tell ya you're a star<endline>You're a star, you're a star, you're a star, you're a star (star)<endline>You're a star and you keep on shinin'<endline>(you're a star, you're a star, you're a star, you're a star)<endline>Pretty girls by the oceanside (side)<endline>Stars that refuse to shine (shine, shine)<endline>This is on your mind (i-i-i-ind-i)<endline>California knows how to party (indeed)<endline>In the city of L.A. (ay ay ay ay ay ay ay)<endline>They say that angels come again<endline>In the city, city of Compton (Compton, Compton, Compton, Compton)<endline>Black people all over the ?other side?<endline>In the city of good ol' Watts (Watts, Watts, Watts, Watts, Watts)<endline>Make them stop, make them stop<endline>In the city, California don't stop (don't stop)<endline>All the way from L.A. to the Bay (indeed)<endline>Stars fall down here, that's what they say (indeed)<endline>All the way from L.A. to the Bay (indeed)<endline>Stars fall down here, that's what they say (indeed)<endline>It's everything they say, it's everything they say<endline>Distant lights from across the Bay<endline>California! It's the C-A-L-I-F-O-R-N-I-A<endline>California knows how to make me smile sometime<endline>Yes they do (woo) yes they do<endline>California-hey-ay knows how to do what they do<endline>When they do what they do<endline>When they do what they do to me and you too, hey-ay<endline>California-how-hey-ay-ay (phenomenon, phenomenon)<endline>Worldwide original style (indeed)<endline>Mos Def on the profile (indeed)<endline>Adamsville droppin' you so very well<endline>Worlwide original style (indeed)<endline>Mos Def on the profile (indeed)<endline>Adamsville rockin' you so very well<endline>Worldwide original style (indeed)<endline>Mos Def on the profile (indeed)<endline>Adamsville rockin' you so very well (indeed)<endline>Worldwide original style (indeed)<endline>Mos Def on the profile (indeed)<endline>Adamsville rockin' you so very well (woo)<endline>In the city of L.A. (ay ay ay ay ay ay ay)<endline>It's everything they say, it's everything they say<endline>It's everything they say, it's everything they say<endline>It's everything they say", "image": "https://images.genius.com/cf856702ecf850832309504729d07177.200x195x1.jpg"}, {"title": "Know That", "album": null, "year": null, "lyrics": "[Mos Def]<endline>I Strike the Empire Back<endline>I Strike the Empire Back<endline>Fuck the Empire<endline>High flying like the Millenium Falcon<endline>Piloted by Han Solo<endline>I never roll for dolo, fronting on me's a no-no<endline>Understand, doing this for my family<endline>Ha ha, check it out y'all<endline><endline>Yo I'm trying to make a dollar out of what makes sense<endline>Add it up, told my daddy I'd be a rich man<endline>You never know when your fate gon' switch hand<endline>Get today's solid ground out of yesterday's quicksand<endline>I was a young boy who dreamt about being a big man<endline>On small looseleaf sheets I sketched a big plan<endline>Gotta handle business properly, boost up my economy<endline>Store it up and get my mom some waterfront property<endline>Yesterday was not for me but nowaday it's time for me<endline>The streets is watching me, I watch back that's the policy<endline>Moving along my odyssey like blood through the artery<endline>Navigate the treacherous and make it seem effortless<endline>Let those who make the exodus seekin the North beacon<endline>From beating and hog-eating, from punishment all season<endline>From hands cracked and bleeding, cotton thorns in your palms<endline>It's for y'all that I sketch these songs, and it goes<endline>Yea, though I walk through the valley of the shadow<endline>I fear no man, because faith is the arrow<endline>My vocal chord travel worldwide to block narrow<endline>We can blow with the ammo or go mano-a-mano<endline>Kweli is you with me (What up, what up)<endline>Let's make it happen<endline>I burn through your argument with action<endline>My eyes stay fastened to tomorrow looking for a brighter day<endline>When y'all wanna leave y'all<endline>Right away<endline><endline>Shout it out from East-West (from South to Northern)<endline>From Cackalack (to California)<endline>From the coldest (to the warmest)<endline>To the borders ('cross the waters) understand..<endline>\".. and know that I love you..\"<endline>We got love in the place<endline>Shout out to all the Queens (all the Seeds)<endline>To all the teams (that's gettin cream)<endline>From outlaw (to emcees)<endline>Make it happen (do your thing) understand..<endline>\".. and know that I love you..\"<endline>Ladies and gentlemen, ladies and gentlemen, ladies and gentlemen<endline><endline>[Mos Def]<endline>Shout it out from East-West<endline>(From South to Northern)<endline>From the richest (to the poorest)<endline>To the elders (in the coffins)<endline>Living native (dying for it) understand<endline>And know that I love you<endline>Yea, yea, we got love in the place<endline>Shout out from up top (to the middle)<endline>To black bottom (sky high!)<endline>Whether you colder than December<endline>Or hotter than July<endline>It don't stop til we complete this<endline>And know that I love you<endline>Keep this fly<endline>It's so much to life when you just<endline>Stay black<endline>My people, my people", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}, {"title": "Life In Marvelous Times", "album": null, "year": null, "lyrics": "[Mos Def]<endline>Bright moments, bright moments always come back vivid<endline>The fifth grade was epic city-wide test pressure<endline>The pre-crack era<endline>Mr. Schumer, what a prick<endline>Attitude match his wardrobe, uglier than sin<endline>This is Bed-Stuy eighty-two<endline>Ninth floor, three tiny rooms, one view<endline>Bucktown, Roosevelt House<endline>Their green grass is green; our green grass is brown<endline>Shots rang, my phone wasn't touch tone<endline>Were heavy beef in the street, E.T. had to flee<endline>Great heavens, good grief<endline>Hungry bellies, bright gold on their teeth<endline>The windows on the Ave look like sad eyes<endline>They fix their sharp gaze on you when you pass by<endline>And if you dare to stand, you can see 'em cry<endline>You can watch 'em scowl, feel 'em prowl<endline>While they're steady sizing every inch about you<endline>Fast math measuring what you amount to<endline>The laughter, the screams<endline>The numeral, the song of songs, the book of dreams<endline>Ends don't meet where the arms can't reach<endline>Mean streets, even when it's free it ain't cheap<endline>On-going saga, terminal diagnosis<endline>Basic survival requires super heroics<endline>No space in the budget for a cape<endline>Assume you gotta fly by night to save the day<endline>Crash-landings routinely happen<endline>Some survive, others never rise from the ashes<endline>Watching asphalt and observing the Sabbath<endline>Creates an Ecstatic and there you have it<endline>From teenage love praying in tongue<endline>Strange fruit, batty boots and native drums<endline>From hence I come, so here we go<endline>Signs and wonders all along the road<endline>Some lies open, some lies closed<endline>Some stretchers role with no lies at all<endline>Some riders don't know what they ridin' for<endline>Hands on the wheel and their mind is gone<endline>Wherever you ride, whatever your lane<endline>This road called life is a beautiful thing<endline>And we are alive in amazing times<endline>Delicate hearts, diabolical minds<endline>Revelations, hatred, love and war<endline>And more and more and more and more<endline>And more of less than ever before<endline>It's just too much more for your mind to absorb<endline>It's scary like hell, but there's no doubt<endline>We can't be alive in no time but NOW<endline><endline>It's just another shot to the heart<endline>It's just a sure shot in the dark<endline>It's just another place in the stars<endline>Wonders on every side, life in marvelous times<endline>Life in marvelous times<endline>Hey! The Ecstatic<endline>The temperature's rising everywhere<endline>All over the world, you can feel it<endline>All over the world, feel it<endline>Spirits rise everywhere<endline>It's just a sure shot to the heart<endline>It's just a sure shot in the dark<endline>It's just another place in the stars<endline>Wonders on every side, life in marvelous times<endline>Life in marvelous times<endline>Now, always", "image": "https://images.genius.com/b13acc0fe75405f9fde88d9e60c03a7a.640x640x1.jpg"}, {"title": "Life Is Good", "album": null, "year": null, "lyrics": "(Intro)<endline>Da Boom Bep Da Boom<endline>Da bang bang bang<endline>Your now rockin wit the best!<endline>HEY! Dante! Masha'Allah (Masha'Allah)<endline>Life is Good<endline>Only Yahweh<endline><endline>(Chorus)<endline>Life is good<endline>Only Yahweh<endline>Life is good<endline>Let's go ya'll (keep goin on)<endline>Life is good<endline>Shit all the time<endline>Life is good<endline>Only Yahweh<endline>Life is good<endline>Go hard keep rockin on<endline>Life is good<endline>Shit all the time<endline><endline>(Verse 1)<endline>Wake up in the mornin!<endline>And I give thanks and praise, Open up the gift called a brand new day<endline>This life is fantastic<endline>It's easy<endline>It's hard<endline>It's intense<endline>It's young<endline>And on and on and on!<endline>Road around hometown on the day I was born<endline>There somethings changed and don't change at all<endline>Like the ghetto feel the pressure on coppas keep stepin on them, hungry got their chopper loaded and it could pop at any moment<endline>Say a prayer for the sick and the sufferin<endline>The odd-turners<endline>The hardworkers<endline>And hustlers<endline>The sinner and saints<endline>The cons and there customers<endline>I came up with them<endline>I keep in touch with them<endline>I show love for them<endline>And show love again<endline>I plant a seed and grow love again<endline>It's most elegant<endline>It's celebrated long time<endline>A lovely the horn that starts decorated voice that of imagination, inspiration information<endline>Salute to Zulu Nation!<endline>It's like peace<endline>Unity<endline>Love<endline>Let's have some fun<endline><endline>(Hook)<endline>It's like Def keep rockin it, you should be rockin it<endline>Brooklyn rockin it<endline>You should be rockin it<endline>Deckstream rockin it<endline>You should be rockin it<endline>And there ain't no stoppin' the sun<endline><endline>(Chorus)<endline>Life is good<endline>Only Yahweh<endline>Life is good<endline>Let's go ya'll (keep goin on)<endline>Life is good<endline>Shit all the time<endline>Life is good<endline>Only Yahweh<endline>Life is good<endline>Go hard keep rockin on<endline>Life is good<endline>Shit all the time<endline><endline>(Hook)<endline>Once again<endline>It's like Def keep rockin it you should be rockin it<endline>Deckstream rockin it<endline>You should be rockin it. Whole world rockin it<endline>You should be rockin it<endline>And there ain't no stoppin' the sun<endline><endline>(Verse 2)<endline>Today I got a call<endline>It was Umi on the horn<endline>Her voice so cool said son<endline>You're a jewel<endline>Protect minor heart and you're soul won't lose<endline>If they prove aren't true<endline>Then don't be deeply fooled<endline>Take care of yourself<endline>Creator got the rest<endline>And never mind stress<endline>Just do your best<endline>So plain so sweet and it hit me so deep with all the blues in the news, that's news that I need<endline>So give thanks<endline>Spread love<endline>Proceed<endline>Not so slow or too swift<endline>God speed<endline>Cruise control and<endline>Rule the world and<endline>Move your body body<endline>Take in short<endline>And stay humble<endline>But be proud<endline>Cry when you need to and laugh out loud<endline>Like peace<endline>Unity<endline>Love<endline>Lets have some fun<endline><endline>(Hook) x2<endline>Its like Def keep rockin it, you should be rockin it<endline>Deckstream rockin it<endline>You should be rockin it<endline>Brooklyn rockin it<endline>You should be rockin it<endline>And there ain't no stoppin' the sun<endline>Once again<endline><endline>(Chorus)<endline>Life is good<endline>Only Yahweh<endline>Life is good<endline>Let's go ya'll (keep goin on)<endline>Life is good<endline>Shit all the time<endline>Life is good<endline>Only Yahweh<endline>Life is good<endline>Go hard keep rockin on<endline>Life is good<endline>Shit all the time<endline><endline>(Outro)<endline>Peace!", "image": "https://images.genius.com/fef6dc45140d6ef66bd5be094928e7df.600x600x1.jpg"}, {"title": "Love", "album": null, "year": null, "lyrics": "My pop said he was in love when he made me<endline>Thought about it for a second wasn't hard to see<endline>I could hear he was sincere, wasn't game or promotion<endline>The entire affair's probably charged with emotion<endline>When love call your heart I guess you gotta pursue<endline>12-11-73, my life is testament<endline>Praise the beneficent<endline>Element that breath<endline>Devoid in the form that make love manifest<endline>I spent my early years in Roosevelt Projects<endline>It was a bright valley with some dark prospects<endline>In '83, Vendy C was the host with the most<endline>I listened to the Rap Attack and held the radio close<endline>I listened to the Rap Attack and held the radio close<endline>This is far before the days of high glamour and pose<endline>Ayo, power from the streetlight made the place dark<endline>I know a few understand what I'm talking about<endline>It was love for the thing that made me wanna stay out<endline>It was love for the thing that made me stay in the house<endline>Spending time, writing rhymes<endline>Trying to find words that describe the vibe<endline>That's inside the space<endline>When you close your eyes and screw your face (close your eyes)<endline>Is this the pain of too much tenderness<endline>To make me nod my head in reverence?<endline>Should I visit this place in remembrance?<endline>Or build landmarks here as evidence?<endline>Nighttime, spirit shook my temperament<endline>To write rhymes that portray this sentiment<endline>We live the now for the promise of the infinite<endline>We live the now for the promise of the infinite<endline>And we believe in the promise<endline>(love x10)<endline><endline>Yes yes y'all, and we don't stop because...<endline><endline>[Refrain]<endline>Check it out y'all (uh), feel me out y'all (say what)<endline>Feel me out y'all (yeah), hear me out y'all (get down)<endline>Check me, out y'all (uh, get down, get down)<endline>Feel me out y'all (down, down), check it out y'all<endline>Now hear out (bounce) y'all<endline>Check me out y'all (uh), feel me out y'all (outside the world)<endline>Check me out y'all, feel me out y'all<endline>Feel me out y'all (hear me bounce y'all) (get down)<endline>Check me out y'all, check it out y'all<endline><endline>My folks said they was in love when they made me<endline>I take the love they made me with to make rhymes and beats<endline>(Can you feel?) The raw deal is all-wheel driven (right)<endline>Contemplate the essence of beats, rhymes and livin'<endline>Speech align with the rhythm (right), designed with the rhythm<endline>Ears and eyes keep in good time with the rhythm<endline>I shine with the rhythm, the Black Star Galactica<endline>You're big number fatin', we ancient like the abacus<endline>After us, I see most proceed to be trees<endline>Sprouting leaves, givin' breeze to the we who believe<endline>I M.C., which means I Must Cultivate the Earth<endline>Straight back, straight back, heartbeats and hard work<endline>I be the \"Funky Drummer\" to soften the hard Earth<endline>(Amin) Pray Allah keep my soul and heart clean<endline>(Amin) Pray the same thing again for all my team<endline>From Restoration to Fort Greene, and on out to Queens<endline>Uptown To Booggiedown, yo just look around<endline>Shook up the world like Ali in 6-3 (right)<endline>I'm reaching a height that you said cannot be<endline>I'm bringing a light which you said we can't see<endline>Saw the new day comin', it look just like me<endline>Sun bursts through the clouds, my photo ID<endline>I bring light to your day and raise your degree<endline>The universal magnetic, you must respect it<endline>From end to beginning: bright, true and living<endline>Ever changing but sustaining magnificent<endline>Building the now for the promise of the infinite<endline>Building the now for the promise of the infinite<endline>Because...<endline><endline>", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}, {"title": "Mathematics", "album": null, "year": null, "lyrics": "Yo, check it<endline>1 for Charlie Hustle, 2 for Steady Rock<endline>3 for the forth-coming live future shock<endline>It's 5 dimensions, 6 senses<endline>7 firmaments of heaven and hell<endline>8 million stories to tell<endline>9 planets faithfully keepin' orbit, with the probable 10th<endline>The universe expands length<endline>The body of my text possess extra strength<endline>Power-lift the powerless up out of this towering inferno<endline>My ink so hot it burn through the journal<endline>I'm blacker than midnight on Broadway and Myrtle<endline>Hip-Hop passed all your tall social hurdles<endline>Like the nationwide projects-prison-industry complex<endline>Working-class poor, better keep your alarm set<endline>Streets too loud to ever hear freedom ring<endline>Say evacuate your sleep, it's dangerous to dream<endline>For ch-ching, cats get the \"cha-pow!\" You dead now<endline>Killing fields need blood to graze the cash cow<endline>It's a numbers game, but shit don't add up somehow<endline>Like I got 16 to 32 bars to rock it<endline>But only 15% of profits ever see my pockets<endline>Like 69 billion in the last 20 years<endline>Spent on national defense, but folks still live in fear<endline>Like nearly half of America's largest cities is one-quarter black<endline>That's why they gave Ricky Ross all the crack<endline>16 ounces to a pound, 20 more to a ki<endline>A 5 minute sentence hearing and you're no longer free<endline>40% of Americans own a cell phone<endline>So they can hear everything that you say when you ain't home<endline>I guess Michael Jackson was right, you are not alone<endline>Rock your hardhat, black, 'cause you in the Terrordome<endline>Full of hard niggas, large niggas, dice-tumblers<endline>Young teens and prison greens facing life numbers<endline>Crack mothers, crack babies, and AIDS patients<endline>Young bloods can't spell but they could rock you in PlayStation<endline>This New Math is whipping motherfuckers' ass<endline>You want to know how to rhyme, you better learn how to add<endline>It's mathematics<endline><endline>Yo, it's 1 universal law, but 2 sides to every story<endline>3 strikes and you biddin' for life, mandatory<endline>4 MCs murdered in the last 4 years<endline>I ain't trying to be the 5th when the millennium is here<endline>Yo it's 6 million ways to die, from the 7 deadly thrills<endline>8-year-olds getting found with 9mils<endline>It's 10 PM, where your seeds at? What's the deal?<endline>He on the hill pumping krills to keep they bellies filled<endline>Light in the ass with heavy steel, sights on the pretty shit in life<endline>Young soldiers trying to earn their next stripe<endline>When the average minimum wage is $5.15<endline>You best believe you've got to find a new grind to get cream<endline>The white unemployment rate is nearly more than triple for black<endline>Some front-liners got their gun in your back<endline>Bubbling crack, jewel theft and robbery to combat poverty<endline>And end up in the global jail economy<endline>Stiffer stipulations attached to each sentence<endline>Budget cutbacks but increased police presence<endline>And even if you get out of prison still livin'<endline>Join the other 5 million under state supervision<endline>This is business; no faces, just lines and statistics<endline>From your phone, your Zip Code, to SSI digits<endline>The system break man, child, and women into figures<endline>2 columns for \"Who is\" and \"Who ain't niggas\"<endline>Numbers is hard and real and they never have feelings<endline>But you push too hard, even numbers got limits<endline>Why did one straw break the camel's back?<endline>Here's the secret<endline>The million other straws underneath it<endline>It's all mathematics<endline><endline>", "image": "https://images.genius.com/fb48b17db99d20e6baaeeb962cf997b3.483x479x1.jpg"}, {"title": "May-December", "album": null, "year": null, "lyrics": "[Instrumental]", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}, {"title": "Modern Marvel", "album": null, "year": null, "lyrics": "This desire...<endline><endline>[Mos Def Singing]<endline><endline>I come home high and she start to cry<endline>I can't take it..<endline>A brand new excuse does me no use<endline>That won't make it..<endline>She be home with the kids, this is no way to live<endline>What can I say?<endline>I know it's surreal but I'm a hard headed still<endline>Do things my way..<endline><endline>And it's so strong, soo strong<endline>It's like I'm dying..<endline>Trying to hold on, my body says oh no oh out there..<endline>Flying, the price that I pay for the game that I play<endline>Ain't no game at all..<endline>I'm up in the clouds and I'm spiraling down<endline>Nothing breaks the fall..<endline><endline>And it's so strong, so strong<endline>It's like I'm dying..<endline>Try to hold on, my body says oh no oh out there<endline>Flying..<endline>Sounds of the sufferers pray<endline><endline>I come home high and she start to cry<endline>I can't take it..<endline>A brand new excuse does me no use<endline>That won't make it..<endline>She at home with the kids, this is no way to live<endline>What can I say?<endline>I know it's surreal but I'm a hard headed still<endline>Black Dante and it's so strong..<endline>So strong..<endline>So strong..<endline>So strong...<endline><endline>I'm out there flying..<endline>Flying..<endline>Flying..<endline>Flying...<endline><endline>This game is fantastic..desire...<endline><endline>[Mos Def Speaking]<endline><endline>Killers..this life this life<endline>Lovers..this life this life<endline>Hustlers..this life this life<endline>Thieves..this life this life<endline>Gamblers..this life this life<endline>Niggas..Crackers..Children..Mothers..Fathers..Lovers..Neighbors..Hungry..<endline>Full..the beautiful..the stars..the distance..the close..the stars..<endline>The heavens..this life<endline>The floor..this life this life<endline>The high..this life<endline>The beneath..this life this life<endline>All..all..everywhere..everywhere..anywhere..somewhere..home...<endline><endline>Come on, this how it goes on..<endline>Ghetto people in the world today, get up!<endline>Ha! Look alive, breathe..wooh!<endline>Ha! How it goes...<endline><endline>[Mos Def Rapping]<endline><endline>Mother, mother...<endline>Head in her hands<endline>Her first born son dead in her hands<endline>The whole thing was a setup, a scam<endline>They knew it was set up and planned<endline>Niggas he worked with wet him and ran, and that's..<endline>Brother, Brother...<endline>But son, I don't see no brother hood<endline>All I see is thugger hood<endline>Get rich and fuck the hood<endline>All they want is some good smoke from the hood<endline>Lookin for the shorty good stroke from the hood<endline>That's how they touch the hood<endline>But when I touch the hood, I'll make it brighter, black<endline>Because I'm brighter, black<endline>And I'm so black I'm bright, shine through the blackest night<endline>Shine when I'm live, shine via satellite<endline>Shout in the hood, we get the picture<endline>Cuz everytime you out in the hood, you got photographers witcha<endline>What's going on? Ha!<endline><endline>Understand this is real life..<endline>This how it goes on, this how it goes on...<endline>It keep going on, this how it goes on...<endline>Ghetto people look alive, get free<endline>Get involved, remain to breathe...Ha! Wooh!<endline><endline>If Marvin was alive now, wow..<endline>What would I say to him?<endline>Where could I start?<endline>How could I explain to him??<endline>I know the minor world would probably look strange to him<endline>Would he feel like today had a place for him?<endline>Global imprisonment, sickness, indifference<endline>When he said, \"Save the babies,\" was we listenin?<endline>When he said, \"Mercy, mercy,\" did he really know..<endline>That decades later we'd still be killin folks?<endline>Or did he hope that we would realize..<endline>That we the first, the son of earth..<endline>The moon and stars, the great beyond..<endline>We black and proud, we brave and strong..<endline>We raise it up, we quiet storm, forever fresh..<endline>And keepin on..?<endline><endline>Ha! Ghetto people look alive and free, ya get real..<endline>This how it goes on, and you say you say<endline>This how it goes on, and you say you say<endline>This how it goes on..<endline>Ghetto people look alive and free and breathe! Ha!<endline>Hold the beat! Stop the beat! Drop the beat!<endline>Hold the beat! Stop the beat! Drop the beat!<endline>Hold the beat! Stop the beat! Drop the beat!<endline>Hold the beat! Stop the beat! Got the beat!<endline><endline>There ain't nothin to be afraid of..<endline>Ghetto people look alive and free, ya get real...<endline>This how it goes on<endline>This how it goes on, keep goin on..<endline>This how it goes on<endline>Now breathe!<endline>Marvelous, marvelous, marvelous, Marvin Modern Marvel...", "image": "https://images.genius.com/338419572381e746b5f1aa0866d2d857.596x596x1.jpg"}, {"title": "Mr. Nigga", "album": null, "year": null, "lyrics": "He under thirty years old but already he's a pro<endline>Designer trousers slung low cause his pockets stay swoll'<endline>Could afford to get up and be anywhere he go<endline>V.I.P. at the club, backstage at the show<endline>(Yes y'all) the best crib, the best clothes<endline>Hottest whips on the road neck and wrists on froze (say word)<endline>Checks with Os, o-o-o-o-ohs<endline>Straight all across the globe, watch got three time-zones<endline>Keep the digital phone up to his dome<endline>Two assistants, two bank accounts, two homes<endline>One problem; even with the Os on his check<endline>The po-po stop him and show no respect<endline>\"Is there a problem officer?\" Damn straight, it's called race<endline>That motivate the jake (woo-woo) to give chase<endline>Say they want you successful, but that ain't the case<endline>You living large, your skin is dark, they flash a light in your face<endline><endline>Yo, the Abstract with the Mighty Mos Def<endline>White folks gotta mumble the chorus beneath they breath<endline>(I didn't say it!)<endline>But they'll say it out loud again<endline>When they get with they close associates and friends<endline>You know, sneak it in with they friends at the job<endline>Happy hour at the bar, while this song is in they car<endline>And even if they've never said it, lips stay sealed<endline>They actions reveal how their hearts really feel<endline>Like, late night I'm on a first class flight<endline>The only brother in sight, the flight attendant catch fright<endline>I sit down in my seat, 2C<endline>She approach officially, talking about, \"Excuse me\"<endline>Her lips curl up into a tight space<endline>Cause she don't believe that I'm in the right place<endline>Showed her my boarding pass, and then she sort of gasped<endline>All embarrassed, put an extra lime on my water glass<endline>An hour later here she come by, walkin' past<endline>\"I hate to be a pest but my son would love your autograph\"<endline>(Wowwww.. Mr. Nigga I love you, I have all your albums!..)<endline>They stay on nigga patrol on American roads<endline>And when you travel abroad they got world nigga law<endline>Some folks get on a plane, go where they please<endline>But I go over seas and I get over-seized<endline>London, Heathrow, me and my people<endline>They think that illegal's a synonym for negro<endline>Far away places, customs agents flagrant<endline>They think the dark faces smuggle weight in they cases<endline>Bags inspected, now we arrested<endline>Attention directed to contents of our intestines<endline>Urinalyis followed by X-rays<endline>Interrogated and detained 'til damn near the next day<endline>No evidence, no apology, and no regard<endline>Even for the big American rap star<endline>For us especially, us most especially<endline>A Mr. Nigga VIP jail cell, just for me<endline>(If I knew you were coming I'd have baked a cake)<endline>Just got some shoe-polish, painted my face<endline>They say they want you successful, but then they make it stressful<endline>You start keeping pace, they start changing up the tempo<endline><endline>You can laugh and criticize Michael Jackson if you wanna<endline>Woody Allen molested and married his step-daughter<endline>Same press kicking dirt on Michael's name<endline>Show Woody and Soon-Yi at the playoff game (holding hands)<endline>Sit back and just bug, think about that<endline>Would he get that type of dap if his name was Woody Black?<endline>O.J. found innocent by jury of his peers<endline>And they been fucking with that nigga for the last five years<endline>Is it fair, is it equal, is it just, is it right?<endline>Do you do the same shit when the defendant face is white?<endline>If white boys doing it, well, it's success<endline>When I start doing, well, it's suspect<endline>Don't hate me, my folks is poor, I just got money<endline>America's five centuries deep in cotton money<endline>You see a lot of brothers caked up, yo straight up<endline>It's new, y'all livin off of slave traders' paper<endline>But I'm a live though, yo I'm a live though<endline>I'm puttin up the big swing for my kids, yo<endline>Got my mom the fat water-front crib, yo<endline>I'm a get her them pretty bay windows<endline>I'm a cop a nice home to provide in<endline>A safe environment for seeds to reside in<endline>A fresh whip for my whole family to ride in<endline>And if I'm still Mr. Nigga, I won't find it suprisin'", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}, {"title": "Ms. Fat Booty", "album": null, "year": null, "lyrics": "In she came with the same type game<endline>The type of girl giving out the fake cell phone and name<endline>Big fame, she like cats with big things<endline>Jewels chipped, money clip, phone flip, the six range<endline>I seen her on the Ave, spotted her more than once<endline>Ass so fat that you could see it from the front<endline>She spot me like paparazzi, shot me a glance<endline>In that catwoman stance with the fat booty pants, hot damn!<endline>What's your name love, where you came from?<endline>Neck and wrist laced up, very little make-up<endline>The swims at the Reebok gym tone your frame up<endline>Is sugar and spice the only thing that you made of?<endline>I tried to play it low key, but couldn't keep it down<endline>Asked her to dance and she was like, \"Yo, I'm leaving now\"<endline>An hour later, sounds from Jamaica<endline>She's sipping Cris straight up, skanking, winding her waist up<endline>Scene 2 - my fam's throwing a jam<endline>Fareed is on the stand, big things is in the plans<endline>The brother Big Mu makes space for me to move<endline>\"Ayo, this my man Mos, baby, let me introduce\"<endline>I turned around (Say word!) it was the same pretty bird<endline>Who I had priorly observed trying to play me for the herb (Yeah, that's her)<endline>Shocked as hell she couldn't get it together<endline>I just played along and pretended I never met her<endline>How you feeling? \"Oh, I'm fine\" My name is Mos \"I'm Sharice\"<endline>I heard so much good about you, it's nice to finally meet<endline>We moved to the booth reserved for crew especially<endline>And honey love ended up sitting directly next to me<endline>I'm type polite but now I'm looking at her skeptically<endline>Cause baby girl got all the right weaponry<endline>Designer fabric, shoes and accessories<endline>Chinky eyes, sweet voice is fucking with me mentally<endline>We conversated, made her laugh, yeah, you know me bro<endline>Even though I know the steelo, she wild sweet, yo<endline>I'm 'bout to murk, I say peace to the family<endline>She hop up like, \"How you gon' leave before you dance with me?\"<endline><endline>Yo, let me apologize for the other night<endline>I know it wasn't right, but baby you know what it's like<endline>Some brothers don't be coming right, I understand, I'm feeling you<endline>Besides, can I have a dance ain't really that original<endline>We laughed about it, traced her arms across my shoulder blades<endline>They playing Lovers Rock, I got the folded fingers on her waist<endline>Heating my blood up like the Arizona summer<endline>Song finished then she whispered, \"Honey, let's exchange numbers\"<endline>Scene 3 - weeks of dating late night conversation<endline>In the crib heart racing, trying to be cool and patient<endline>She touched on my eyelids, the room fell silent<endline>She walked away smiling, singing Gregory Isaacs<endline>Like, \"If I don't, if I don't have you\"<endline>Showing me her tan line and her tattoo<endline>Playing Sade, Sweetest Taboo<endline>Burning candles, all my other plans got cancelled<endline>Man I smashed it like a Idaho potato<endline>She call me at my J.O., come now, I can't say no<endline>Ginseng tree trunks, rocking the P-funk<endline>Cocking her knees up, champion lover not ease up<endline>Three months, she call I feel I'm running a fever<endline>Six months, I'm telling her I desperately need her<endline>Nine months, flu-like symptoms when shorty not around<endline>I need more than to knock it down, I'm really trying to lock it down<endline>Midnight we hook up and go at it<endline>Burn a stoge and let her know, sweetheart I got to have it<endline>She telling me commitment is something she can't manage<endline>Wake up the next morning, she gone like it was magic<endline>Ahh, damn it, my shit is on Harrison Ford Frantic<endline>My 911's unanswered by my fly Taurus enchantress<endline>Next week, Mu hit me up, I saw Sharice at the Kittie club<endline>With some banging ass Asian playing lay it down and lick me up<endline>What!?", "image": "https://images.genius.com/fb48b17db99d20e6baaeeb962cf997b3.483x479x1.jpg"}, {"title": "Ms. Fat Booty 2", "album": null, "year": null, "lyrics": "Modern girls!!<endline><endline>(sung)<endline>I know, I can't afford to stop<endline>For a moment.. that it's too soon.. to for..<endline><endline>[Mos Def] - speaking over sung vocals<endline>I say girls, girls, girls, girls<endline>Reach out and clap your hands<endline>I be the fabulous man so, just play the fabulous fan<endline>And, bring the breeze, bring the breeze<endline><endline>[Mos Def]<endline>And from the moment that I saw ya, I knew you was trouble<endline>But I disregarded, detour signs<endline>And did not stop til you was mine<endline>I guess God was like, aight fine<endline>Careful what you wish for, cause you just might get it in heaps<endline>Try to give it back he be like - nah that's yours to keep<endline>So poetic baby girl you make it hard to speak<endline>My dream lover make it hard to sleep<endline>.. I wrote a little song about it<endline><endline>In she came with the same type game<endline>The hairdo, Prada shoes, brand new Gucci frame<endline>Big thangs, so big you can't hardly explain<endline>When she done crossed her legs, she make mind turn insane<endline>Had seen her on the ave and spotted her, how I wanted her<endline>Ass so fat she think police tryna follow her<endline>What you lo-lo-love, expert in the bedwork corridor<endline>Man see a touches her, man you'll feel sorry for<endline>Hustlers, bubblers, jugglers, sufferers<endline>All wanna know what her name and phone number was<endline>They're spendin up their money like, post them up and touch her up<endline>But it don't (?) tough, X-amount of (?)<endline>Son, bwoy, African and tough, all nice and decent<endline>A-yeah yeah, I'm tryin to ride with a diamond like you<endline>Lookin pretty in the club, plus she love Mos and Wu<endline><endline>[Ghostface Killah]<endline>Ass wide and fat, breasts mad, hair wrapped<endline>Wilma style, chunky, that's how I like my batch<endline>You a rose from the hood, smoked out of 89<endline>We headed back, you had a baby by Ron<endline>But that's irrelevant, bygones is bygones<endline>Calgon is Calgons, love it when you jump in Ghost thongs<endline>Steppin out of B-B-Q's<endline>'Member when we licked the cream out of Suzy Q's?<endline>Spaghetti jewels, the big word on the street<endline>You like Millie Jackson in the new Mack flick carryin heat<endline>Or say with Oprah with a makeover, Billie Jean slash Dairy Queen<endline>Fantasy is, can I eat you on the swing?<endline>See it's written all over my face, Daily News<endline>Big bold lettered, front page, Starks how it taste?<endline><endline>(sung)<endline>.. forget<endline>I know, I can't afford to stop<endline>For a moment.. that it's too soon.. to forget<endline>I know, I can't afford to stop<endline>For a moment.. that it's too soon.. to for..<endline><endline>[Mos Def] - speaking over sung vocals<endline>To all the fine-ass ghetto troublemakers from all over the world<endline>Ass from New York, to L.A., Miami to Atlanta G.A<endline>Cakalaks, to the Bay.. any place in the world that they stay<endline>Even Japan and the U.K., you know you got to<endline><endline>[Mos Def]<endline>Watch out! Louisana jug wine and conk out<endline>Throw her hands high and make her backside pop out<endline>Watch out! If you don't have the V.I.P. lacq' out<endline>Them big dollars they talk 'bout, just turn around and walk out<endline>You better watch out! Exotic fabrics, speech in larynx<endline>Think it's mid-day traffic, runnin game like the Mavericks<endline>Makin time seem elastic when we stretch out and smash it<endline>Then vanish like a phantom and hurt my understandin like WHAT??<endline><endline>(sung)<endline>.. forget<endline>I know, I can't afford to stop<endline>For a moment.. that it's too soon.. to forget<endline>I know, I can't afford to stop<endline>For a moment.. that it's too soon.. to forget<endline>I know, I can't afford to stop<endline>For a moment.. that it's too soon.. to forget<endline>{*music gradually fades out*}<endline><endline>[Mos Def] - speaking over sung vocals<endline>Special, special dedication<endline>To all the fine-ass ghetto troublemakers, out in the world today<endline>Some in this very party right here right now tonight<endline>Some of them listenin to this song in they jeeps<endline>Some of them listenin to this song at they job<endline>Some of them runnin game on some cat right now<endline>I want you to just rock and bounce to that<endline>Rock and bounce to that<endline><endline>{*music comes back in*}<endline><endline>[Mos Def]<endline>I say girls, girls, girls, girls<endline>Reach out and clap your hands<endline>I be the fabulous man so, just play the fabulous fan<endline>And, bring the breeze, bring the breeze<endline>Say girls, girls, girls, girls<endline>Reach out and clap your hands<endline>I be the fabulous man so, just play the fabulous fan<endline>And, bring the breeze, bring the breeze<endline>{*music and vocals fade*}", "image": "https://images.genius.com/bb2a12043d5bed3ffa2d2b0d3814b69b.600x600x1.jpg"}, {"title": "New World Water", "album": null, "year": null, "lyrics": "New World Water make the tide rise high<endline>Come inland and make your house go \"Bye\" (My house!)<endline>Fools done upset the Old Man River<endline>Made him carry slave ships and fed him dead nigga<endline>Now his belly full and he about to flood somethin<endline>So I'mma throw a rope that ain't tied to nothin<endline>Tell your crew use the H2 in wise amounts since<endline>It's the New World Water; and every drop counts<endline>You can laugh and take it as a joke if you wanna<endline>But it don't rain a full week some summers<endline>And it's about to get real wild in the half<endline>You be buying Evian just to take a fuckin bath<endline>Heads is acting wild, sippin poor, puffin dank<endline>Competin with the next man for higher playin rank<endline>See I ain't got time try to be Big Hank<endline>Fuck a bank; I need a twenty-year water tank<endline>Cause while these knuckleheads is out here sweatin they goods<endline>The sun is sitting in the treetops burnin the woods<endline>And as the flames from the blaze get higher and higher<endline>They say, \"Don't drink the water! We need it for the fire!\"<endline><endline>Man, you gotta cook with it, bathe and clean with it (That's right)<endline>When it's hot, summertime you fiend for it (Let em know)<endline>You gotta put it in the iron you steamin with (That's right)<endline>It's what they dress wounds and treat diseases with (Shout it out)<endline>The rich and poor, black and white got need for it (That's right)<endline>And everybody in the world can agree with this (Let em know)<endline>Consumption promotes health and easiness (That's right)<endline>Go too long without it on this earth and you leavin it (Shout it out)<endline>Americans wastin it on some leisure shit (Say word?)<endline>And other nations be desperately seekin it (Let em know)<endline>Bacteria washing up on they beaches (Say word?)<endline>Don't drink the water, son they can't wash they feet with it (Let em know)<endline>Young babies in perpetual neediness (Say word?)<endline>Epidemics hopppin up off the petri dish (Let em know)<endline>Control centers try to play it all secretive (Say word?)<endline>To avoid public panic and freakiness (Let em know)<endline>There are places where TB is common as TV<endline>Cause foreign-based companies go and get greedy<endline>The type of cats who pollute the whole shore line<endline>Have it purified, sell it for a dollar twenty-five<endline><endline>", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}, {"title": "Niggas In Poorest", "album": null, "year": null, "lyrics": "Poor so hard, my clean clothes look grimy, pretty women don't mind me<endline>So what's fifty grand to a young nigga like me? More than my annual salary<endline>Poor so hard, this shit crazy, walk outside the whole world hate me<endline>Nervous stares at the thoroughfare, surveillance cameras, police tracing<endline>Poor so hard, this shit weird, we be home and still be scared<endline>There's grief here, there's peace here, easy and hard to be here<endline>Psycho, liable to turn Michael, take your pick, Myers, Myers, Myers, same shit<endline>Poor so hard, got holey socks, dope block on my stove top<endline>Jumbotrons for astronauts, high in orbit off planet rock, say<endline>Poor so hard, this chopper too, we starving Marvin, you hot food<endline>There's birds of prey, no escape, open-air prison, local zoo<endline>Poor so hard, who getting faded? Little Maurice in the sixth grade<endline>No mama, no father, role model the dope game, say<endline>Poor so hard, bitch behave, standing behind the deuce-deuce-trey<endline>Ice-cold, heat blow, closed casket, cold case<endline><endline>These young bloods is looking scary at the mall<endline>They wearing pants, you can still see they drawers<endline>They rob a nigga in the bathroom stall<endline>They took his life cause he ain't want to take it off<endline>Poor so hard, that shit cray, ain't it, Bey? Diabetics, fish filet<endline>Poor so hard, your house so cold, nigga, it ain't spring<endline>Every winter landlord fuckin' with my heat again<endline>Bougie girl, grab your hand, show you how to do this ghetto dance<endline>Fuck your French, we ain't in France, I'm just saying<endline>Prince Williams ain't do it right, if you ask me<endline>If I was him, I'd put some black up in my family<endline>Fake Gucci, my nigga, fake Louis, my killa<endline>Real drugs, my dealer, who the fuck is Margiela?<endline>Doctors say I'm the illest, I ain't got no insurance<endline>It's them niggas in poorest, be them rebel guerillas, huh<endline><endline>To the kings and queens and everyone in every place, yo<endline>Don't get caught up in no throne, don't get caught up in no throne<endline>Don't get caught up in no throne<endline>Towers of Babylon rise up and so they shall fall<endline>As it was written before, amen, so it goes on<endline>Don't get caught up in no throne, don't get caught up in no throne<endline>Don't get caught up in no throne<endline>These devils out here lying, acting like the people ain't dying<endline>We silver and they gold, ain't never saved a soul<endline>Don't get caught up in no throne, don't get caught up in no throne<endline>Don't get caught up in no throne<endline>Signs through the earth and through the heavens, lunar, solar eclipses<endline>We seeking for forgiveness and safety for our children<endline>Don't get caught up in no throne, don't get caught up in no throne<endline>Don't get caught up in no throne, Allah is in control", "image": "https://images.genius.com/f923ffbc28e6a7d873e4a7c6c8870721.600x646x1.jpg"}, {"title": "No Hay Nada Más", "album": null, "year": null, "lyrics": "Buenas, Flaco<endline>Llámame Flaco, pero mi primer nombre es Yasiin Dante<endline>El apellido es Bey<endline><endline>Oiga<endline>Eso soy testigo<endline>La hermosa, el peligro distinto claro que si la verdad<endline>La calle, el pueblo<endline>Las fincas y centros<endline><endline>Ciudad calidad no mejor, mala mas<endline>Guerra y vida, amor y cambio<endline>Comida la guarda<endline><endline>Pistola, oracion para ellos<endline>Damas y caballeros<endline>Familia, crianza<endline>La luz en la distancia<endline><endline>Quiero y lo dijo<endline>Bien es mas cercana<endline>Mi vista, mi casa, mis sueños, mi alma<endline><endline>Quiero saber lo senti tu abrazo<endline>Y tu contacto<endline>Muestreme  algo<endline>Claro<endline>Amen<endline><endline>Claro, claro, claro que si<endline>No hay nada mas<endline><endline>No hay nada mas<endline>Final<endline>No hay nada mas<endline>Claro, claro, claro que si<endline>No hay nada mas<endline>Y no hay nada mas<endline>Final<endline>No hay nada mas<endline>Claro, claro, claro que si", "image": "https://images.genius.com/b13acc0fe75405f9fde88d9e60c03a7a.640x640x1.jpg"}, {"title": "Oh No!", "album": null, "year": null, "lyrics": "Say my name, say my name<endline>Observe how I stake my claim, I independently lay it down<endline>And played my game, my own two raise my flame<endline>Cause dickriding ain't my thang<endline>I earned what they said I wouldn't<endline>I got it the way they said I couldn't<endline>But now I'm getting it and they whole grill is crooked<endline>Mad cause I'm getting caked out from my bookings<endline>When y'all was asking permission I just stepped up and took it<endline>What!? The kid's better buy my rookie card now<endline>Cause after this year the price ain't coming down<endline>And if you got a joint bubbling then get money now<endline>Cause in a minute, there's gonna be some real trouble coming out<endline>Just a warning, as usual some cats won't heed it<endline>The hard-headed always gotta feel it to believe it<endline>It's a shame the jealous gaze is too short to see it<endline>But when they face hit the cement, they nod in agreement<endline>We could play nice and decent, or dirty like the 7-1 Precinct<endline>Call it a day or make it a long evenin<endline>You keep on scheming, man give me some more reason<endline>To have the women in your mama's church screaming \"Lord Jesus!\"<endline>Harder than y'all cause I'm smarter than y'all<endline>I know that deep down it's got to be bothering y'all<endline>Pay attention, watch Flaco get larger than y'all<endline>Put your pride on the rocks, make you swallow it all<endline>The mathematic problem for y'all, it just get harder to solve<endline>Every day that the saga evolve<endline>The do or die stay rumbling and bumbling hard<endline>And when we move, we ain't got no discussion at all<endline>East coast on your neck and you ain't shrugging it off<endline>Try to bullyfoot and end up stumbling off<endline>I'm Daddy Brooklyn, y'all niggas are the sons of New York<endline>Getting spanked when there's too much trouble to talk<endline>Respect mine<endline><endline>", "image": "https://images.rapgenius.com/704254bba6be81d7d607f166ee93a864.500x500x1.jpg"}, {"title": "Pistola", "album": null, "year": null, "lyrics": "[Mos Def]<endline>Criminal minded, gangster of love<endline>Charms in your arms, your gun is wild warm<endline>Worn, bang bang, shoot 'em up<endline>Tips in your clip, click-clack, use 'em up<endline>Bad intentions and a very good shot<endline>X marks the spot where you cross the heart<endline>Candlelight vigil on my memory block<endline>Commemorate the date where the bomb got dropped<endline>Love, study war no more<endline>Put your weapon away, quit collecting the slain<endline>She said \"You right, I don't wanna fight<endline>I just like the fire and the flashing... lights\"<endline><endline>[Mos Def]<endline>If you are to fall in love<endline>Then where should you stand to begin with?<endline>And when the falling's done<endline>How bad should you plan to get injured?<endline>And if you land on your feet<endline>Do it count as a fall or a jump?<endline>And do it feel like a fall<endline>When the hands that pushed you were holding you up?<endline>Close encounter, got you wide open<endline>Heartache got your boom-box going<endline>Music and vocals, lonely and soulful<endline>Your back at the scene where your sweet dreams sold you<endline><endline>", "image": "https://images.genius.com/b13acc0fe75405f9fde88d9e60c03a7a.640x640x1.jpg"}, {"title": "Pretty Dancer", "album": null, "year": null, "lyrics": "Absolutely, Flaco!<endline><endline>Fresh and I'm fresh and my fresh just get fresher<endline>Diamonds in production glow greater than the pressure<endline>The none turn to some and the some turn to more<endline>The more turn to many and the many turn to all<endline>Shoutin' all or nothing like it's nothing at all<endline>Do not kno' what ya got til it got gone<endline>Same song, new time signature<endline>New brand hustle with the long time arithmetic<endline>Bey, from the preacher man, number man, understand<endline>Curves and sliders, overs and under-hands<endline>Black Batman, knock em out the park<endline>Pitch, quiet fire sniper not the one you tryna box with<endline>Block work when the block turn jobless<endline>And triple beams ain't the best means to weigh your options<endline>Smarts!, get smart with your smartness<endline>Too busy surviving to argue 'bout Darwin....Darling!<endline><endline>Chorus:<endline>See me, huh, a pretty dancer<endline>Me, Sugar Ray and Ali pretty dancer<endline>See me do it, (echo)<endline>Ready, steady, step it out<endline><endline>Big swing swing with bangers and thing thingers<endline>Soul glo zinging all over the ring finger<endline>Yo Yo! Don't play me so close<endline>Make me tell you something that you ain't really ready to know<endline>Fight camp you was in top form<endline>Fight night, damn you ain't breakin' popcorn<endline>Aw man word bond?<endline>Word is bond! Ultimatum<endline>Lights off, smelling salts resuscitate em<endline>I don't underrate em son, I don't nothing-rate em<endline>All I do is pop pop, frustrate em<endline>Exacerbate em, sharp shoot, lacerate em<endline>Steady hustle, shuffle shuffle, fascinate em<endline><endline>Ecstatic nature black imagination activated<endline>True and living elevated, you are rockin' with the greatest<endline>Ecstatic nature black imagination activated<endline>True and living elevated, you are rockin' with the greatest<endline><endline>It's like a dove from up above<endline>(Chorus)<endline>Fly like a dove from up above<endline>(Chorus)<endline><endline>Skip<endline>Move<endline>(x4)<endline><endline>Fly like a dove from up above<endline>(repeated until end)<endline><endline>The greatest<endline>See me do it!<endline><endline>Ecstatic nature black imagination activated<endline>True and living elevated, rockin' with the greatest<endline>Ecstatic nature black imagination activated<endline>True and living elevated, you are rockin' with the greatest<endline>(repeated until end)", "image": "https://images.genius.com/b13acc0fe75405f9fde88d9e60c03a7a.640x640x1.jpg"}, {"title": "Priority", "album": null, "year": null, "lyrics": "[Mos Def]<endline>Bey!<endline>Top priority<endline>Peace before everything, God before anything<endline>Love before anything, real before everything<endline>Home before anyplace, truth before anything<endline>Style and stay radiate, love power slay the hate<endline>Truth killer flaky face, Bey'll say it to they face<endline>Ain't afraid to major straight, grace set the table straight<endline>Flow greatest like the greatest lakes<endline>Capes on great estates, quiet water major waves<endline>Steer the course, make a way<endline>And come ashore on a greater day<endline>Home grown from the greatest grain<endline>Full flavor in the native strain, now put that on your brainy brain<endline>Full exposure to faith and slang<endline>Minimum wage and major gains<endline>Yasiin Dante to Bey<endline>From day to night to day to day they came to play<endline>We came to stay, get out the way<endline>Be-otch sunspot hot heat rocks<endline>Brooklyn finest, preservation of beat-box!<endline>Friend or foe poison or detox<endline>When we rock the people I respond: priority<endline>Peace before anything, God before everything<endline>Love before anything, real before everything<endline>Home before anyplace, shoot before anything<endline>Style and state radiate, love power slay the hate<endline>Priority!<endline>Love powers...", "image": "https://images.genius.com/b13acc0fe75405f9fde88d9e60c03a7a.640x640x1.jpg"}, {"title": "Quiet Dog Bite Hard", "album": null, "year": null, "lyrics": "[Fela Kuti speaking]<endline>One thing I want to assure them<endline>If they think I'm gonna change or compromise<endline>My attitude and my way of life or<endline>In my expression or in my goal<endline>Towards politics<endline>They are making me stronger<endline>And I am much more stronger now..<endline><endline>[Mos Def]<endline>Bang to the boogy<endline>Say upchuck the boogy<endline>To the rhythm of the boogity beat [x2]<endline><endline>There it go like simple the plainness, it's primal and basic<endline>Zulu arrangement rockin' amazement<endline>Flaco, radiating from heaven to pavement<endline>They phony as a face lift, I’m nothing to play with<endline><endline>Spent time hating it but that ain't changing it<endline>God give it to me no body ain't takin' it<endline>Therefore, moving on the base for stimulus<endline>Standing in the twilight and watching them get it in<endline><endline>Walls, tremblin', the air, simmering<endline>She movin' like more than her ears are listenin', whoa now<endline>Testin' your equilibrium<endline>Sonic wave booming all over your intimate<endline><endline>Skin on skin and skin on skin again<endline>Put it all, get it all, get on get it in<endline>Ladies and gentlemen, misters and mistresses<endline>Cousins, uncles, aunties, and synonyms, there it is, boogieman<endline><endline>Hah<endline>Simmer down simmer down simmer down now<endline>Simmer down now x3<endline>Quiet dog, bite hard my god<endline><endline>Said and the rocket don't stop<endline>Brooklyn in the kitchen heat up the stove top<endline>Bey in the empire state and navigating the way<endline>Preservation makes the greatest hip hop<endline>The cool dudes swagger they terribly corny<endline>The flow so petty,unsteady, it's boring<endline>These dudes ain't dope but they on it<endline>They need to get off it, so \"wack wack\" is all you can call it<endline>Therefore, movin on to Def for stimulus<endline>Regardless of what zone, what town you represent<endline>A bullet into all your settlements<endline>Tower to tenement<endline>I mold through for all of the element<endline>Simmer down<endline>I manage your mayhem<endline>I'm bright as the AM<endline>Engine 'bout to roll out the station<endline>I'm blessed with the fresh from day one<endline>I got it from day done<endline>We all going back to the same one<endline>It's the cost of motivation I'll stay with<endline>Remarkable flavors<endline>That all bear the mark of the greatness<endline><endline>Woah now<endline>Is to get us to buck town<endline>Your girl is in love now<endline>You chumps don’t want to get shut-down, Shoo<endline><endline>[Sirens]<endline>Simmer down simmer down simmer down now<endline>Simmer down now x3<endline>Quiet dog, bite hard, let's rock<endline><endline>Hah<endline>And we don't stop<endline>See you rock to the rhythm we don't stop<endline>So you maintain the rock and you don't stop<endline>You keep up the rock and you don't stop<endline>(The rock)<endline>Maintain the rock and you don't stop<endline>(The rock)<endline>You keep up the rock and you don't stop<endline>(The rock)<endline>Maintain the rock and you don't stop<endline>(The rock)", "image": "https://images.genius.com/b13acc0fe75405f9fde88d9e60c03a7a.640x640x1.jpg"}, {"title": "Revelations", "album": null, "year": null, "lyrics": "Boogieman<endline>Standing in the sun getting black as I want<endline>You playing good D, and that ain't backing me up<endline>Skywalker baby, ain't no jack in my hammer<endline>I got a whole lot to say so I ain't talking to them<endline>I hear em eavesdroppin<endline>I turn it up louder<endline>Black freedom, black genius, black power<endline>Black ink for printing the black dollar<endline>And tell the CIA I say, now what?<endline>And cc: is central bank<endline>Loose change body slamming big money tanks<endline>We tell god thanks<endline>Ya'll tellin us that god don't rank<endline>That's why your breath stank<endline>Yuck<endline>Lay off the bacon and smokes<endline>Quit laying off the good working folks quit the hoax<endline>And lay off the corny color jokes<endline>And contrary to popular the coloreds is awoke<endline>Ya big dope<endline>Yuck<endline>Keep them out your face keep em in your prayers<endline>Either that keep em in the cross hairs<endline>Better still keep a even dose of each cause until you get justice<endline>You won't get peace<endline>Peace peace peace peace peace<endline>The gun shot say wa da da dang<endline>Wa da da da da dang<endline>Wa da da da da da da da da dang ay!<endline>They shout peace peace peace<endline>They shout peace peace peace<endline>The firefight lit wa da da dang<endline>Wa da da da da dang<endline>Wa da da da da da da da da dang ay!<endline>Rumors and rumors and rumors of war can I get better now what is that for<endline>And more<endline>Rumors and rumors and rumors of war killers just killing now what they kill for<endline>And more<endline>Rumors and rumors and rumors of war can I get better now what is that for<endline>And more<endline>Rumors and rumors and rumors of war<endline>Revelations<endline>Dont stop keep on", "image": "https://images.genius.com/b13acc0fe75405f9fde88d9e60c03a7a.640x640x1.jpg"}, {"title": "Rock N Roll", "album": null, "year": null, "lyrics": "[Mos Def]<endline>Make me wanna holla!<endline>\"Ah.. ah-ah, ah-ah.. ah-ah, ah-lert the squad..\"<endline>Rock and roll<endline><endline>(Huh) My grandmomma was raised on a reservation<endline>(Huh) My great-grandmama was, from a plantation<endline>They sang - songs for inspiration<endline>They sang - songs for relaxation<endline>They sang - songs, to take their minds up off that<endline>Fucked up situation<endline>I am, yes I am, the descendant (yes yes)<endline>Of those folks whose, backs got broke<endline>Who, fell down inside the gun smoke<endline>(Black people!) Chains on their ankles and feet<endline>I am descendants, of the builders of your street<endline>(Black people!) Tenders to your cotton money<endline>I am hip-hop<endline>\"It's heavy metal for the black people\"<endline>I am rock and roll (rock and roll, rock'n'roll)<endline>Been here forever<endline>They just ain't let you know (HA!)<endline><endline>I said, Elvis Presley ain't got no soul (huh)<endline>Chuck Berry is rock and roll (damn right)<endline>You may dig on the Rolling Stones<endline>But they ain't come up with that style on they own (uh-uh)<endline>Elvis Presley ain't got no soul (hell naw)<endline>Little Richard is rock and roll (damn right)<endline>You may dig on the Rolling Stones<endline>But they ain't come up with that shit on they own (nah-ah)<endline><endline>Guess that's just the way shit goes<endline>You steal my clothes and try to say they yours (yes they do)<endline>Cause it's a show filled with pimps and hoes<endline>Trying to take everything that you made or control (there they go)<endline>Elvis Presley ain't got no soul<endline>Bo Diddley is rock and roll (damn right)<endline>You may dig on the Rolling Stones<endline>But they ain't the first place the credit belongs<endline><endline>I ain't trying to diss<endline>But I don't be trying to fuck with Limp Bizkit (\"The fuck is on your mind?\")<endline>When I get down in my zone<endline>I be rockin Bad Brains and Fishbone<endline>I ain't tryin to slow your groove<endline>But that ain't the way I'm trying to move<endline>I don't turn on Korn to get it on;<endline>I be playing Jimi Hendrix 'til the dawn<endline>That's my word is bond<endline>Sitting up on my front lawn<endline>Got the volume turned to ten<endline>Playing Albert King the best again (black)<endline>When the morning in the cooker<endline>Got to turn on some John Lee Hooker<endline>When I want some rock and roll<endline>Go to Otis Redding to get some soul<endline><endline>Say, James Brown got plenty of soul<endline>James Brown like to rock and roll<endline>He can do all the shit fo' sho'<endline>That Elvis Presley could never know (black people)<endline>Said, Kenny G ain't got no soul<endline>John Coltrane is rock and roll (uh-huh)<endline>You may dig on the Rolling Stones<endline>But they could never ever rock like Nina Simone<endline><endline>\"ah-lert the squad\"<endline><endline>{*Music picks up pace and gets louder*}<endline><endline>Who am I, huh!<endline>Get your punk ass up<endline><endline>Elvis Presley ain't got no soul<endline>Jimi Hendrix is rock and roll<endline>You may dig on the Rolling Stones<endline>But everything they did they stole<endline>Elvis Presley ain't got no soul<endline>Bo Diddley is rock and roll<endline>You may dig on the Rolling Stones<endline>But we send their punk ass home<endline><endline>Who am I? (Rock and roll) (x10)<endline><endline>Say, rock and roll!<endline>Who am I? Rock and roll! (x6)<endline><endline>Get your punk ass up<endline>Company, move<endline>For Harlem, Fort Greene, Compton<endline>East St. Louis, Detroit (BO BO)<endline>Chicago (BO BO) Bed-Stuy (BO BO)<endline>Flatbush (BO BO) Brownsville (BO BO)<endline>East New York (BO BO) Newark New Jersey (BO BO)<endline>Illadelphia Cincinnati Atlanta the Dirty South<endline>All towns GET YOUR PUNK ASS UP!!<endline>\"Rock and roll for the black people\"<endline>Hi ma<endline><endline>\"Well that was just wonderful\"", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}, {"title": "Roses", "album": null, "year": null, "lyrics": "Power and grace<endline>Yellow for friendship, red for love<endline>Black for the universal stars above<endline>Pink buds that I bought her on Valentine<endline>She said it was forever then she changed her mind<endline>I said a little prayer then I cleared my eyes<endline>Cause I feel the draw on my heartstrings, drawing the line<endline>Started off with a orchid, natural portrait<endline>I ain't Picasso but that ain't important<endline>Faith, smart dude never graduated at art school<endline>Stay tuned I'm a show you how my art move<endline>Shape and dimension flow and extension<endline>Symmetry shade, blowin' out the frame<endline>Sign off my name Dante when I'm finished<endline>Put it to your memory for permanent exhibit<endline>Love, hard work and it's worth every minute<endline>Abstract is still life real life kinetic<endline><endline>[Georgia Anne Muldrow & Yasiin Bey]<endline>Got my pencil (Check one), got pretty paper (Check two, check it out)<endline>Please don't worry we're forgiven (Power and grace to creation)<endline>You don't have to (No necessary), cut up no roses (Be easy, chopper!)<endline>Please just leave them living<endline><endline>", "image": "https://images.genius.com/b13acc0fe75405f9fde88d9e60c03a7a.640x640x1.jpg"}, {"title": "Sensei on the Block", "album": null, "year": null, "lyrics": "", "image": "https://images.genius.com/4d1a9757d430776710118a3e0ba4658f.1000x667x1.jpg"}, {"title": "Sex, Love & Money", "album": null, "year": null, "lyrics": "Freaky black beauty with the party pal<endline>Where you work it out got me fiendin'<endline>Bam, I hit the G ready for the street<endline>Heavy, ghetto sweet breezing through the evening<endline>Bam, I'm on the lounge path for the warm blast<endline>Got the John Shaft cocked back and loaded<endline>Bam, I beat it, word john, body awesome<endline>Is the way that you come that got me goin'<endline>Bam, I'm on the back streets rollin'<endline>I'm playin back all the magic moments<endline>Don't front, you know I got ya, know I got ya<endline>You sneaky freaky, but I know about ya, know about ya<endline>You straight dope, I can't do without ya, go without ya<endline>Lay back and relax you mind, I'm 'bout to<endline>Double the doses in half the time<endline>Ha, master physical, mastermind<endline>You play it quiet but in private that ass is mine<endline>We body rockin' the last of time<endline>And then we, we body rockin' the last of time<endline>And then we, body rockin' the last of time<endline>And then we, her body rockin' huh, her body rockin'<endline>Now shell on one deep it ain't nobody steppin'<endline>Honey shell on ten deep it ain't nobody steppin'<endline>Thousand shell or hundred deep, I'm there the body rockin', come on<endline><endline>Freaky black beauty pretty purse and blouse<endline>Where you took it out got me leanin' --bam<endline>I hit the streets easy in my seat<endline>Lighting on my feet breezy like the evening --bam<endline>I'm on the lunch pack feel the warm blast<endline>Boogie Bohn Shaft cocked and loaded --bam<endline>Top and bottom, body awesome<endline>Is the way that you come that got me goin' --bam<endline>I'm on the back roads rollin', rollin'<endline>I'm playin back all the magic moments, don't front<endline>She know I got'cha, know I got'cha<endline>You sneaky freaky, but I know about'cha, know about'cha<endline>You goog hurricane, go without'cha, go without'cha<endline>Lay back and relax you mind<endline>I'm bout to, double the doses in half the time, huh<endline>Master physical, mastermind<endline>You play it quiet but in private a-ha a-ha, huh<endline>We body rockin the last of time<endline>And then we, we body rockin the last of time<endline>And then we, we body rockin the last of time<endline>And then we, the body rockin huh, the body rockin huh<endline>The body rockin huh, the body rockin huh, the body rockin huh<endline>The body rockin says, DON'T STOP THE BODY ROCK<endline><endline>DANGER<endline>Ain't gotta say no more", "image": "https://images.genius.com/338419572381e746b5f1aa0866d2d857.596x596x1.jpg"}, {"title": "Speed Law", "album": null, "year": null, "lyrics": "Clear like a megaphone, pretty nigga heart skipped the metronome<endline>Rocked the Trump Tower to the terrordome<endline>Poor house to pleasure domes<endline>Soprano, alto, tenor to baritone<endline>MOS DEF one of the illest that you ever known<endline>Rock steady baby, you a stepping stone<endline>Smash your foundation into pebbles<endline>My words leave your nerves unsettled<endline>You take it to the next level down<endline>Looking like a circus clown<endline>Cats like you can't even get a pound<endline>Worldwide from the river to lakeside<endline>My stage show stay live, make the sound man stage dive<endline>I cut fat cats to eight lives with my eight ball lines<endline>I'm home 'fore I'm done with all nine<endline>Got you shook like a fault line<endline>Come all shine and get tarnished<endline>Brooklyn got your pay roll garnished<endline>They form a huddle<endline>Whisper like they want trouble<endline>I melt the ice grills into rainwater puddles<endline>Make the proud-hearted leave on the humble<endline>Black steel in the hour<endline>Assemble my skill form my power<endline>My poems crush bones into powder<endline>You mumble like a coward<endline>I'm Mos Def, you need to speak louder<endline>Superheroes<endline>Get your power, your masks and capes snatched<endline>Brooklyn take what you can't take back<endline>I know a lot of cats hate that<endline>All I can say black<endline>There's a city full of walls you can post complaints at<endline>All the doubters and believers adjust your receivers<endline>\"I feel it,\" you can taste it through the speakers<endline>The three six oh-riginal sketch lyrics so visual<endline>They rent my rhyme books at your nearest home video<endline><endline>My joint's so passionate<endline>Make you peal out and mash your shit<endline>Get wild cold crash your whip<endline>Front chassis wrecked, but ock you can't be too upset<endline>Tow truck got my tape in the deck<endline>I'm permanent like tattoos and birth marks<endline>Third degree burn marks<endline>Driving on tracks like Dale Earnhardt<endline>Stay on the low like the herb spot<endline>Put a big loss on your earn chart<endline>Nice since the nurse signed my birth chart<endline>Seldom seen but often heard, while your jams is barely heard<endline>Just my name is a daily word<endline>From avenues to streets, terraces and park places<endline>Stair wells, jail cells, penthouse to basements<endline>Arrangement basic, but still fans chase it<endline>Y2K can't delete the true ancient<endline>Apache war drum on the ranges<endline>Skill level dangerous<endline>Arrow head that killed all the cavemen<endline>They cry John-Blazing, but step on the pavement<endline>And get violated like a plaintiff<endline>I ain't shit to play with<endline>I give a Goddamn what your name is<endline>Delete it and make it so it never get repeated<endline>Believe it<endline>Tell the feds, tell your girl, tell your mother<endline>Conference call you wack crew and tell each other<endline>That they just ain't holding me<endline>I'm Mos Def, you hopefully<endline>Mush on before you get bust off like a ovary<endline><endline>", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}, {"title": "Sunshine", "album": null, "year": null, "lyrics": "I don't hate players, I don't love the game<endline>I'm the shot clock, way above the game<endline>To be point blank with you motherfuck the game<endline>I got all this work on me, I ain't come for play<endline>You can show the little shorties how you pump and fake<endline>But dog, Not to def, I'm not impressed<endline>I'm not amused, I'm not confused, I'm not the dude<endline>I'm grown man business, and I am not in school<endline>Put your hand down youngin' this is not for you<endline>On my J.O. with beats by Kan-ye yo<endline>My name on the marquee, your name off the payroll<endline>Style fresh, like I'm still a day old<endline>And it's been like that since the day yo<endline>On more time than a Roley, or Seiko<endline>Step on deck, your neck do what I say so<endline>Get up or get out, get down or lay low<endline><endline>Slim nigga that casts a big shadow<endline>Cherokee red to shoot the long arrow<endline>Got more skill, more aim, and more ammo<endline>You can get it all from a big or small barrel<endline>Like, hail Mary, full of grace<endline>Niggas come in and shoot up the place<endline>And make you pull up your face<endline>The deck, I'm a pull out the ace<endline>From the jungles of the empire state<endline>Where it ain't no escape, 247, 718<endline>And thats like every night, every day<endline>From the place that I settle and stay<endline>To the states, I'm collecting my pay<endline>Blast off then I'm back to the K<endline>Hold it down so my family straight<endline>Represent in a family way<endline>Pro ball not for amateur play<endline>Been raw since the amateur stage<endline>Before the press had the cameras raised<endline><endline>Cause it is deeper, sweeter, richer, crisper<endline>Stronger reception and sharper picture<endline>Revolve around God, and involve with niggas<endline>These elements help evolve my scripture<endline>And make Mos Def a classic modern figure<endline>Brooklyn it don't matter if you holler or whisper<endline>Your coming through clear, cause I'm right here wit'cha<endline>Ain't gotta edit your slang, I got it, I get ya<endline>Yo, brothers and sisters, fathers and mothers<endline>The lovers, the leavers, the doubters, believers<endline>The stayers, the quitters, the bitches, the niggas<endline>Rebel guerrillas to ghetto civilians<endline>Y'all 'gon feel it from the first to the millionth<endline>It's extra, ordinary and plain<endline>I walk a thousand paces of light ahead of the game<endline>By the time that you get where I'm standing, I'll be gone<endline>Y'all make moves, but y'all just move wrong<endline><endline>", "image": "https://images.genius.com/338419572381e746b5f1aa0866d2d857.596x596x1.jpg"}, {"title": "Supermagic", "album": null, "year": null, "lyrics": "[Mos Def]<endline>Bismillah hir rahman ir rahim<endline><endline>[Malcolm X]<endline>\"You're living at a time of extremism, a time of revolution<endline>A time where there's got to be a change<endline>People in power have misused it<endline>And now there has to be a change<endline>And a better world has to be built<endline>And the only way is going to be built is with extreme methods<endline>And I for one will join in with anyone<endline>Don't care what color you are!<endline>As long as you want to change this miserable condition<endline>That exists on this earth<endline>Thank you.\"<endline><endline>[Mos Def]<endline>Ecstatic<endline>Ecstatic ecstatic<endline>Classic<endline>Flow<endline><endline>Super magic black origin freshly out of dopeness<endline>Definitely out of dopeness, sketch another opus<endline>Knock off your set, Brooklyn we keep 'em open<endline>The heavens expand the stars advance feel the boogieman<endline><endline>Mojo hand healing power like Bang<endline>Snap, I rebuke these snitches<endline>We know the truth, you can't confuse me bitches<endline>Great name, greater than all your riches<endline>Yah Dante Flaco Bey that's the business<endline>Repeat, I rebuke these snitches<endline>We know the truth, you can't confuse me bitches<endline>Strong magic that bust all your wishes<endline>Cherokee Chief rock upon cha rock it don't stop<endline>And let's get<endline><endline>Yes<endline>You're now rockin' with the Def<endline>Lararara<endline>Oh Oh Oh Oh<endline><endline>It's like heartbeat, you make me feel<endline>So... REAL<endline><endline>Super magic black origin freshly out of dopeness<endline>Definitely out of dopeness, sketch another opus<endline>Knock off your set, Brooklyn we keep 'em open<endline><endline>Again again<endline>Super magic black origin freshly out of dopeness<endline>Definitely out of dopeness, sketch another opus<endline>Knock off your set, come close and get 'em open<endline><endline>Get it here, let it go!<endline><endline>Ecstasy<endline><endline>The heavens expand the stars advance feel the boogieman<endline><endline>Nice!<endline>Magic!", "image": "https://images.genius.com/b13acc0fe75405f9fde88d9e60c03a7a.640x640x1.jpg"}, {"title": "The Boogie Man Song", "album": null, "year": null, "lyrics": "[Mos Def]<endline>Bismillah ir Rhman ir Raheem<endline>{In The Name Of God, The Most Merciful, The Most Compassionate}<endline><endline>What it is, what it is, what it is<endline>What it is<endline>What it is, what it is, what it is<endline>What it is<endline>See me, want me, give me, touch me<endline>Feed me, fuck me, love me, trust me<endline>This whole world is cold and ugly<endline>What we are is low and lovely<endline>I am the most beautiful boogie man<endline>The most beautiful boogie man<endline>Let me be your favorite nightmare<endline>Close your eyes and I'll be right there<endline>Wide open... All over... Again<endline>See me, touch me, give me, want me<endline>Feed me, fuck me, trust me, love me<endline>This whole world is cold and ugly<endline>What we are is low and lovely<endline>I am the most beautiful boogie man<endline>The most beautiful boogie man<endline>Let me be your favorite nightmare<endline>Close your eyes and I'll be right there<endline>Wide open... All over... Again, again...<endline>Ag-a-in<endline>(Fades Out)", "image": "https://images.genius.com/338419572381e746b5f1aa0866d2d857.596x596x1.jpg"}, {"title": "The Embassy", "album": null, "year": null, "lyrics": "Boogey (Boogey) man (man)<endline><endline>\"This is your captain speaking, with just a little flight information<endline>Coming up on the left we're going to be catching a glimpse of the Grand Canyon<endline>On the right you can be able to see the Hoover Dam<endline>In just a a few minutes. We're flying at an altitude of 37,000 feet<endline>And our air speed is four hundred miles an hour...<endline>Couple a little facts here, I'm packing a Colt King Cobra<endline>That's a .357 caliber firearm with a black rubber-grip and a six inch barrel<endline>Also, the co-pilot is carrying a Kimber Custom defense pistol with all the bells and whistles you'd expect from a custom gun of that kind with an alloy frame and bevel treatment on the entire gun<endline>And our Chief Flight Attendant Roger has a uh Ruger Bearcat, that .22 with a hand-fluted cylinder<endline>All three are capable of piercing body<endline>Armor at a distance of up to twenty-seven feet and you can put a hole<endline>In human bone and flesh the size of the Grand Canyon, which<endline>By the way is coming up on the left hand side of the plane, so just<endline>Sit back, relax, and enjoy the rest of your flight...\"<endline><endline>[Mos Def]<endline>From the top, la, la, la, la...<endline>La, la, la, la, lalalalala...<endline>La, la, la, la... la-la-la-la-la-la-la-la<endline>Mentioned that he worked for the embassy<endline>People seem to find that interesting<endline>High status, intrigue and mystery<endline>Special code name on the hotel registry<endline>I love it when they say<endline>\"Enjoy your stay\"<endline>They say how they mean it<endline>Cause that's the way they been trained<endline>Show you to your room<endline>A suite with a view<endline>When, if anything at all<endline>Do not hesitate to call<endline>Nice! The greatest, the greatest<endline>Compliments, tooth brush, tooth paste, razors<endline>A Bible, a Qur'an in a drawer<endline>Or depending where you are<endline>Tend to whisper through the walls<endline>She was calling on God<endline>The greatest, the greatest<endline>Salutations, congratulations<endline>Reservations, exclusive arrangements<endline>Dinner with the patrons, the scenery is amazing<endline>It's so outrageous, they whisper when they say it<endline>When it's really real it's even realer than \"The Matrix\"<endline>Classic, modern, ancient, flagrant<endline>Get a special thrill every time they get to say it<endline>Peace! I work with the embassy<endline>On behalf of imagination industry<endline>I come visit, you come visit<endline>Such a pleasure, official business<endline>La, la, la, la...<endline>La, la, la, la, la-la-la-la...<endline>(Boogey, boogey, man, man)<endline>La, la, la, la...la-la-la-la-la-la-la-la<endline>The Embassy...greetings", "image": "https://images.genius.com/b13acc0fe75405f9fde88d9e60c03a7a.640x640x1.jpg"}, {"title": "The Light Is Not Afraid Of The Dark", "album": null, "year": null, "lyrics": "I'm ready, ready for action<endline>Intimate swift like a cash transaction<endline>Speaker blows out from row house to the mansion<endline>This ghetto sound rap, an arousal of passion<endline>They don't know the language, but shoutin' the anthem<endline>The beat translated make the world understand some<endline>My voice like magic, my flow fantastic<endline>In summary I'm rare, ordinary, elaborate<endline>But check the profile, this is lyrically handsome<endline>Resembles my pay scale, slim nigga, ain't frail<endline>And I ain't in the gym on some Ebony man shit<endline>I'm in the laboratory, bench pressin' the standard<endline>It's your hand, I'm liftin' the bar [?]<endline>Get close to the Gods, stay focused and sharp<endline>It's High stakes and there's way more than paper involved<endline>You must evolve or die, that ain't falsified<endline>Home team I know you keep trouble on your mind<endline>Don't let bullshit knock you off your grind<endline>And that's real talk for all of mine and for all of yours<endline>I rock steady, keep your bounce of course<endline>I'm low key, cool breeze, man I'm 'bout my balls<endline>Tap tap, knock down your door<endline>Tap tap and break down the wall, collect and count it all<endline>And like \"Bang\" in the air, I'm gone<endline>See I'm ridin' on, keep cool, you can ride along<endline>But keep it up, you won't ride for long<endline>And that's word to God, BK show me where you are<endline>Word to Lord we the brightest stars<endline><endline>It’s like, get your mind right ‘te is the twilight<endline>I'm Strong in the limelight, sharper than hindsight<endline>Cherokee [?] see through the hype hype<endline>Blow up the sights like they [?]<endline>Blow valley survivor, rider or driver<endline>The engine [?] sees the victory in street<endline>Gettin' that dolo when we gettin' that [?]<endline>The most powerful culture's on coast and it's skin deep<endline>Who hear me? Put Simply<endline>I Kill confusion and build your movement<endline>Skill and the will to do [?]Undeniable proven<endline>Magnetic contributions<endline>We all know around and behind the music<endline>Black dons constitution<endline>Straight ahead and elusive, black Dons, they exclusive<endline>So let's do this<endline><endline>I'm ready, ready for action<endline>Intimate swift like a cash transaction<endline>Speaker blows out from row house to the mansion<endline>This ghetto sound rap, an arousal of passion<endline>They don't know the language, but shoutin' the anthem<endline>The beat translated make the world understand some<endline>My voice like magic, my flow fantastic<endline>In summary I'm rare, ordinary, elaborate<endline>But check the profile, this is lyrically handsome<endline>Resembles my pay scale, slim nigga, ain't frail<endline>And I ain't in the gym on some Ebony man shit<endline>I'm in the laboratory, bench pressin' the standard<endline>It's your hand, I'm liftin' the bar [?]<endline>Get close to the Gods, stay focused and sharp<endline>It's High stakes and there's way more than paper involved<endline>You must evolve or die, that ain't falsified<endline>Home team I know you keep trouble on your mind<endline>Don't let bullshit knock you off your grind<endline>And that's real talk for all of mine and for all of yours<endline>I rock steady, keep your bounce of course<endline>I'm low key, cool breeze, man I'm 'bout my balls<endline>Tap tap, knock down your door<endline>Tap tap and break down the wall, collect and count it all<endline>And like \"Bang\" in the air, I'm gone<endline>See I'm ridin' on, keep cool, you can ride along<endline>But keep it up, you won't ride for long<endline>And that's word to God, BK show me where you are<endline>The coolest thing and the brightest star", "image": "https://images.genius.com/4d1a9757d430776710118a3e0ba4658f.1000x667x1.jpg"}, {"title": "The Panties", "album": null, "year": null, "lyrics": "[Yasiin Bey]<endline>I just want you to, relax<endline>Ease into it<endline><endline>Baby slow down, just take your time<endline>You and me gon' be here for a while, okay<endline>Baby don't rush this, take your time<endline>You and me gon' be here for a while, okay<endline>I got so much that I want to do<endline>I just wanna be close to you, okay<endline>I got so much that I want to do<endline>That I can show you better than I can say<endline><endline>Don't wanna be nowhere but here<endline>Nowhere in this atmosphere<endline>Stratosphere, ionosphere<endline>Ain't no sphere that's bright like here<endline>Don't wanna be nowhere but here<endline>Nowhere in this atmosphere, I'm good where I am<endline><endline>Baby slow down, take your time<endline>You and me goin' be here for a while, okay, hey<endline>I got so much that I want to do<endline>I can show you better than I can say, let me show you<endline><endline>Let me show you, let me show you<endline>Let me show you, let me show you<endline>I wanna show you, let me show you<endline>Let me show you, let me show you<endline><endline>Oh baby, you make me feel so good<endline>Come let me take you by the hand<endline>Oh baby, you make me feel so good<endline><endline>Let me show you how, let me show you how<endline>Let me show you now, let me show it out<endline>Let me show you how, I wanna show ya how<endline><endline>Let me show ya, let me show ya<endline>Let me show ya, let me show ya, let me show ya, ohh<endline><endline>Baby slow down just take your time<endline>You and me goin' be here for a while, okay, hey<endline>I got so much that I want to do<endline>That I can show you better than I can say<endline><endline>Enough talk and let's move<endline>Come on, come on, come on, come on<endline>Come on, come on, come on, come on<endline>Come on, come on, come on, come on", "image": "https://images.genius.com/338419572381e746b5f1aa0866d2d857.596x596x1.jpg"}, {"title": "The Rape Over", "album": null, "year": null, "lyrics": "(Boogie man business)<endline><endline>Listen<endline>Old white men is runnin' this rap shit<endline>Corporate forces runnin this rap shit<endline>Some tall Israeli is runnin this rap shit<endline>We poke out our asses for a chance to cash in<endline>Cocaine, is runnin this rap shit<endline>Dro, 'gnac and E-pills is runnin this rap shit<endline><endline>The rape over, turn your face over nigga<endline>No god in disguise, it's me, game over<endline>Hey lil souljahs is you ready for war?<endline>But don't ask what you're fighting for<endline>Just hope that you survived the gunfight, the drama, the stress<endline>You get in the line of fire we get the big ass cheques<endline>You gettin your choice of pimp, make your choice and fall in<endline>This is ho stroll B I, take that cock in your behind, biatch<endline>Hit the streets and perform for us<endline>Hold hard and bring it on to us, fucker<endline>I let you sip cups of Army, get a Mercedes<endline>And kick back and let you pay me, my Mack is crazy<endline>I leave the, knife and fist fight filled with glamour<endline>Yeah, take a picture with this platinum-plated sledgehammer<endline>We over-do it add the fire and explosion to it<endline>We sow confusion, we run rap music<endline><endline>MTV, is runnin this rap shit<endline>Viacom is runnin this rap shit<endline>AOL and Time Warner runnin this rap shit<endline>We poke out our asses for a chance to cash in<endline>Cocaine, is runnin this rap shit<endline>Hennessey, is runnin this rap shit<endline>Quasi-homosexuals is runnin this rap shit<endline><endline>Watch out we run the world<endline><endline>That's it", "image": "https://images.genius.com/338419572381e746b5f1aa0866d2d857.596x596x1.jpg"}, {"title": "The Universal Magnetic", "album": null, "year": null, "lyrics": "(Ladies and gentlemen, we'd like to introduce a very<endline>Interesting young man that has traveled from very far<endline>Away to be with us tonight)<endline><endline>There is such a place that creates such a melody<endline>Brooklyn! Go ladies!<endline>It's a living dream, it's a living dream, it's a living dream<endline>Love like this!<endline><endline>Recognize all area crew<endline>Whether you speak Japanese or Goonie Goo Goo<endline>Son when I come through, other rappers boo-hoo<endline>Cause they know they style's soft like baby doo-doo<endline>I will continue to hit like a fifth of Stolichnaya<endline>Putting jokers on ice to get the cream like Breyers<endline>No secret, Mos Def is the one the hons admire<endline>I get in my stance and set the dance on fire<endline>Spread out my wings and I take the world higher<endline>Peace to the fam magnetic in the Chi<endline>Jah Born, Top Sean and my man Ato<endline>And all my other clan who reside in the Zoo<endline>Got the celebrated oatmeal broadcast brew<endline>Mos Def gon' keep it naked like Umfufu (Eddie!)<endline>Words adhere to the tape like crazy glue<endline>So when they bounce out of speakers they stick to you<endline>The way that I communicate is non-typical<endline>But eye level like a 3-D visual<endline>I hold the mic extension, exhibit level and dimension<endline>And radiate the space like a upright bass<endline>Yo son I leave crews laced and escape with no trace<endline>Sound official like the finish time at a horse race<endline>Here to put it in place, for the nine-uno-seis<endline>Mos Def set the pace, make your fam give chase<endline><endline>Baby it's in my chromosomes to rock microphone sets<endline>Who wanna test the M-O-S just leave that shit alone<endline>I make no bones or poems about dropping bars<endline>Make the world fall sway under the Mos Def, yes<endline>I ring the alarm like Tenor Saw<endline>My style hella-raw, I keep it raw bone like Skeletor<endline>And you should go and tell your clientele<endline>That they need to get the message like Melle Mel<endline>I got the shit on lock like a death row cell<endline>And if I ain't a b-boy, Premier never used a bell (ding ding)<endline>So tell your poor ass crew to retire<endline>Before I make they ass catch fire like Richard Pryor<endline>Non-descriptive fiending for riches, calling Earths bitches<endline>But most of y'all brothers is living with your mothers<endline>The boogie man yanking up your covers<endline>Sharper than some new box cutters, on Parkay's and butters<endline>And Stevie Wonder's, to make you run and tell the others<endline>The beat lovers, and play my jam like the numbers<endline>Son I rock the globe like I rocked your boat<endline>I'm 'bout to tap it on your shoulder cause you got to know<endline><endline>", "image": "https://images.genius.com/4c11dc2db95d74f078cbd2d3ba8f0118.640x637x1.jpg"}, {"title": "Twilite Speedball", "album": null, "year": null, "lyrics": "[Mos Def]<endline>Have fun y'all<endline>Have fun y'all<endline><endline>The city breathing all down your neck<endline>Bad news and good dope special effects<endline>And reality's teeth<endline>Bright, black, sinking in deep<endline>Who ain't shy of the pain?<endline>Who ain't shy if the pleasure just the same?<endline>Life is a game I heard the homie say<endline>Well I came to win so I'm not here to play<endline><endline>Have fun (Get it, get it)<endline><endline>Don't stop<endline>Ecstatic<endline>Fantastic<endline>Wild<endline>People<endline><endline>Bad news and good dope<endline>Powder, potion, pills, smoke<endline>Baby, how you trying to go?<endline>Duro o dolce, fast or slow?<endline>Yay, no?<endline>It's OK you can have it your way love<endline>It ain't all good but baby I'm cool<endline>Feeling great, feeling good how are you?<endline><endline>10% Condition, 90% response<endline>Survival mathematics the number mad song<endline>Old dads drop the jewels so pure<endline>When the times get raw, there's something I recall<endline>Sometimes I don't remember it at all<endline>And it gets stormed by the weather with no umbrella<endline>Sky release pressure and the ground get wetter<endline>My outfit f'd up<endline>Could'a looked fresher<endline>But guess what?<endline>The hell with parade day rain<endline>Tsunami and sunshine a vomit is the same<endline>Life is a game I heard the homie say<endline>Well I came to win<endline>Dante<endline><endline>Get it get it<endline>Bey!<endline>Get it get it<endline>Brooklyn<endline>Get it get it<endline>Ecstatic<endline>Don't Stop<endline>E'day<endline>Speedball<endline><endline>Bad news and good dope<endline>Powder, potion, pills, smoke<endline>Baby, how you trying to go?<endline>Duro o dulce, fast or slow?<endline>Yay, no?<endline>It's OK you can have it your way love<endline>Nasty times, but baby I'm cool<endline>Feeling great, feeling good<endline><endline>Ey'day<endline>Every day<endline>Having a good time<endline>Every day<endline>Having a good time<endline>Every day<endline><endline>Bey!<endline><endline>Having a good time every day<endline><endline>That's cool...", "image": "https://images.genius.com/b13acc0fe75405f9fde88d9e60c03a7a.640x640x1.jpg"}, {"title": "UMI Says", "album": null, "year": null, "lyrics": "Put my heart and soul into this song<endline>I hope you feel me<endline>From where I am, to wherever you are<endline>I mean that sincerely<endline>Tomorrow may never come<endline>For you and me, life is not promised<endline>Tomorrow may never appear<endline>You better hold this very moment very close to you<endline>Very close to you, so close to you<endline>So close to you, don't be afraid, to let it shine<endline><endline>Sometimes I get discouraged<endline>I look around and, things are so weak<endline>People are so weak<endline>Sometimes, sometimes I feel like crying<endline>Sometimes my heart gets heavy<endline>Sometimes I just want to leave and fly away (Like a dove)<endline>Sometimes I don't know what to do with myself<endline>Passion takes over me<endline>I feel like a man, going insane, losing my brain<endline>Trying to maintain, doing my thang<endline>Put my heart and soul into this y'all<endline>I hope you feel me where I am, to wherever you are<endline>Sometimes I don't want to be bothered<endline>Sometimes I just want a quiet life, with<endline>Me and my babies, me and my lady<endline>Sometimes I don't want to get into no war<endline>Sometimes I don't wanna be a soldier<endline>Sometimes I just wanna be a man, but<endline><endline>Black people unite and let's all get down<endline>Gotta have what<endline>Gotta have that love<endline>Peace and understanding<endline>One God, one light<endline>One man, one voice, one mic<endline>Black people unite come on and do it right<endline>Black people unite come on and do it right<endline>Black people unite come on and get down<endline>Gotta have what<endline>Love, peace and understanding<endline>One God, one voice, one life<endline>One man, gon' shine my light<endline>Black people unite, now hop up and do it right<endline>Black people unite, now come on and do it right<endline>Yeah baby that's what I like<endline>Yeah baby that's what I like<endline><endline>", "image": "https://images.genius.com/7e6832cab470314ffb530b255928573d.600x600x1.jpg"}, {"title": "U R the One", "album": null, "year": null, "lyrics": "When it started I knew it was trouble<endline>But you know me, them \"hard and everythings\" can't hold me<endline>I need some shit straight out the movies<endline>Drama, warm to the touch, hot mama<endline>Put me all in like launch jeans and scama<endline>You was Mrs. Mine, so fine<endline>Went from \"we gon' conquer it all\"<endline>To \"nigga I'mma see you in court\"<endline>I woulda never thought, I guess I better think again<endline>Ok, now the shit is really sinkin' in<endline>We ain't just divorced, we ain't even fucking friends<endline>Cause in the end it was all about the ends<endline>But fuck that I know it gotta be more to it<endline>Held up with bitter hate with crosses all through it<endline>And when I looked, what did I see?<endline>You on the other end crying like me<endline>Expression on your face like, \"How could this be?\"<endline>That's what I'm asking, \"What the fuck happened?\"<endline>How could all the magic and passion just vanish<endline>Went from outsanding to making me shout, \"Dammit!\"<endline>Can't explain the changes, behavior's is outlandish<endline>Now I'm just stuck in the road feeling stranded<endline>I'm in the dark wishing for the answers<endline>On some old Biggie give me one more chance shit<endline>When we met your face so brown<endline>Your ass so round, of course I'm so down<endline>Wish I knew then what the fuck I know now<endline>Couldn't read the signs in the road: \"Slow down!\"<endline>I'm too deep in the road now<endline>Got me pulling over getting smoked out<endline>Fighting tears that I can't hold down<endline>Can't believe it, this fucka's got me weeping<endline>I keep it a secret so my friends won't peep it<endline>But late in the evening I'm up, my chest heaving<endline>I'm reaching in the dark and I'm looking for the reason<endline>Why? Did our love have to die? You and I were so fucking fly<endline>Can't get it off my mind, the things that made me smile now make me cry<endline><endline>", "image": "https://images.genius.com/50acba8e30cec066c838d6f22dd475e3.500x500x1.jpg"}, {"title": "Wahid", "album": null, "year": null, "lyrics": "(La ilaha ill'Allah)<endline><endline>[Mos Def]<endline>When...all...is...said...and...done...there's...only...one<endline><endline>Cash and carry, legendary, Sagitarri, style's vary<endline>And it's very necessary get it clearly<endline>Never scary barely worried bright and early<endline>Bald head straight or curly mundane or other worldly<endline>No chain, nada jewelry that jackers can't snatch<endline>The gingerbread the slave masters can't catch<endline>Blat! Now put your minds on that<endline>Get real or get back quit frontin face facts<endline>The old timers say we're living in the final days<endline>Gun smoke young folks living any kind of way<endline>Gangster holiday greedy snakes and hideaways<endline>Meanwhile soldiers take it straight through their armor plates<endline>Crash hit the market gates marvels of the modern age<endline>Access is instant and treachery is commonplace<endline>I sense the dangers and I'm not afraid<endline>Because when all is said and done there's only ONE<endline><endline>Man up playboy playing the game boy<endline>Pull back spectacular aim boy<endline>Say what you say boy whoever could make noise<endline>And ride range off in the same voice<endline>Conduct an arrangement with definite language<endline>It's pure inspiration for this generation<endline>Speak true free love<endline>Because when all is said and done there's only ONE<endline><endline>And the one can done so cool<endline>Schooling the young like Rev. Run (\"whose house?\")<endline>Quote Pac and tell 'em keep their heads up<endline>And when the pressure comes down press back and press up<endline>Fret not ghetto world guess what<endline>God is on your side the devil is a lie (alive?)<endline>The Empire holds all the gold and the guns<endline>But when all is said and done there's only...<endline>La ilaha ill'Allah<endline><endline>B.O.O.G.I.E.M.A.N", "image": "https://images.genius.com/b13acc0fe75405f9fde88d9e60c03a7a.640x640x1.jpg"}, {"title": "Workers Comp.", "album": null, "year": null, "lyrics": "[Refrain]<endline>I'll give you all the diamonds and money<endline>But you can't break my heart<endline>Cause that'll just get you fired<endline>And everybody needs a job<endline><endline>Work is scarce, competition is fierce<endline>Fonzi frontin' in the new leather like they don't care<endline>Word, let's get you an award for that performance<endline>Winner in the category for the best boring<endline>Uh, tell the tough guys we tougher than tough times<endline>And needles in the nerves to make the tighten up unwind<endline>One time, for locking out the light in your eyes<endline>You're searching for your perfect one<endline>Broken down from getting it all to take it however it comes<endline>Plain day, you the specialest one, oh me, oh my<endline><endline>[Refrain]<endline>I'll give you all the milk and the honey<endline>But you can't break my heart<endline>Cause that'll just get you fired<endline>Sloppy worker get your pay grade bust<endline><endline>Work is scarce, skilled working is rare<endline>Fonzi fronting at the job site, primping up they hair<endline>Word, well tell them only staff could drink they coffee<endline>Walking papers at the office, sleep late tomorrow morning<endline>Tell the tough guys we tougher than tough times<endline>And nerves don't snap when the clock touch crunch time<endline>That's right we tougher than tough times<endline>From been narrowing, to the clock just unwind<endline>For sure we tougher than tough times<endline>My proof don't need to lie, my tighten up don't unwind<endline>Sunshine, lifting up the light in your eyes<endline>You're gazing at your perfect one<endline>Broken down from never at all to better than you could ever want<endline>Great day I know that you had to come, oh me oh my<endline><endline>[Refrain]<endline>I'll give you all the diamonds and money<endline>But you can't break my heart<endline>Cause that'll just get you fired<endline>And you're doing such a beautiful job", "image": "https://images.genius.com/b13acc0fe75405f9fde88d9e60c03a7a.640x640x1.jpg"}]}